{"0.1.0":{"info":{"author":null,"author_email":"pizza1016 <10370007-pizza1016@users.noreply.gitlab.com>","bugtrack_url":null,"classifiers":["Development Status :: 3 - Alpha","Intended Audience :: Developers","License :: OSI Approved :: Apache Software License","Operating System :: OS Independent","Programming Language :: Python :: 3","Programming Language :: Python :: 3.12","Programming Language :: Python :: 3.13","Programming Language :: Python :: 3.14","Topic :: Other/Nonlisted Topic","Topic :: Software Development :: Libraries :: Python Modules","Topic :: Utilities","Typing :: Typed"],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":"public transport, transportation, melbourne, victoria, australia, ptv, public transport victoria, yarra trams, library, api wrapper","license":"# Copyright and licensing  The source code in this project is licensed under the Apache Licence, version 2.0, which allows anyone to use, copy, modify and distribute the source code in this project, provided that the licence and any copyright notices, and, where you or someone else has modified one or more files before distribution, a notice stating that that person has changed those files, are distributed with the source code. For convenience, a copy of the licence is provided below these notices.  For this project, a URL to this licence page or the main licence page at https://www.apache.org/licenses/LICENSE-2.0 is sufficient for providing a copy of this licence for the purposes of clause 4(a) of the licence.  **Note that the Apache Licence only applies to the source code and not the data obtained from the APIs.**  Data from the PTV Timetable API is open government data that is separately licensed under the Creative Commons Attribution 4.0 International licence (CC BY 4.0) by the Department of Transport and Planning of Victoria, Australia, which can be found at https://creativecommons.org/licenses/by/4.0/legalcode.en.  Data from the Yarra Trams TramTracker data service is proprietary data by Keolis Downer Rail (KDR) Victoria and their terms of use can be found at https://yarratrams.com.au/terms-conditions.  ---  ## Apache Licence Version 2.0, January 2004<br /> http://www.apache.org/licenses/<br /> This copy of the licence has been edited for style; the original licence terms prevails in the event of any inconsistency.  ### Terms and conditions for use, reproduction and distribution  #### 1. Definitions  In these terms:  - ***licence*** shall mean the terms and conditions for use, reproduction, and distribution as defined by sections 1 through 9 of this document.  - ***licensor*** shall mean the copyright owner or entity authorized by the copyright owner that is granting the licence.  - ***legal entity*** shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means: - (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or - (ii) ownership of fifty percent (50%) or more of the outstanding shares, or - (iii) beneficial ownership of such entity.  - ***you*** (or ***your***) shall mean an individual or legal entity exercising permissions granted by this licence.  - ***source*** form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.  - ***object*** form shall mean any form resulting from mechanical transformation or translation of a source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.  - ***work*** shall mean the work of authorship, whether in source or object form, made available under the licence, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix at https://www.apache.org/licenses/LICENSE-2.0).  - ***derivative works*** shall mean any work, whether in source or object form, that is based on (or derived from) the work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this licence, derivative works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the work and derivative works thereof.  - ***contribution*** shall mean any work of authorship, including the original version of the work and any modifications or additions to that work or derivative works thereof, that is intentionally submitted to licensor for inclusion in the work by the copyright owner or by an individual or legal entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a contribution.\"  - ***contributor*** shall mean licensor and any individual or legal entity on behalf of whom a contribution has been received by licensor and subsequently incorporated within the work.  #### 2. Grant of copyright licence  Subject to the terms and conditions of this licence, each contributor hereby grants to you a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright licence to reproduce, prepare derivative works of, publicly display, publicly perform, sublicense, and distribute the work and such derivative works in source or object form.  #### 3. Grant of patent licence  Subject to the terms and conditions of this licence, each contributor hereby grants to you a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent licence to make, have made, use, offer to sell, sell, import, and otherwise transfer the work, where such licence applies only to those patent claims licensable by such contributor that are necessarily infringed by their contribution(s) alone or by combination of their contribution(s) with the work to which such contribution(s) was submitted. If you institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the work or a contribution incorporated within the work constitutes direct or contributory patent infringement, then any patent licences granted to you under this licence for that work shall terminate as of the date such litigation is filed.  #### 4. Redistribution  You may reproduce and distribute copies of the work or derivative works thereof in any medium, with or without modifications, and in source or object form, provided that you meet the following conditions:  - (a) You must give any other recipients of the work or derivative works a copy of this licence; and - (b) You must cause any modified files to carry prominent notices stating that you changed the files; and - (c) You must retain, in the source form of any derivative works that you distribute, all copyright, patent, trademark, and attribution notices from the source form of the work, excluding those notices that do not pertain to any part of the derivative works; and - (d) If the work includes a \"NOTICE\" text file as part of its distribution, then any derivative works that you distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the derivative works, in at least one of the following places: within a NOTICE text file distributed as part of the derivative works; within the source form or documentation, if provided along with the derivative works; or, within a display generated by the derivative works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the licence. You may add your own attribution notices within derivative works that you distribute, alongside or as an addendum to the NOTICE text from the work, provided that such additional attribution notices cannot be construed as modifying the licence.  You may add your own copyright statement to your modifications and may provide additional or different licence terms and conditions for use, reproduction, or distribution of your modifications, or for any such derivative works as a whole, provided your use, reproduction, and distribution of the work otherwise complies with the conditions stated in this licence.  #### 5. Submission of contributions  Unless you explicitly state otherwise, any contribution intentionally submitted for inclusion in the work by you to the licensor shall be under the terms and conditions of this licence, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate licence agreement you may have executed with licensor regarding such contributions.  #### 6. Trademarks  This licence does not grant permission to use the trade names, trademarks, service marks, or product names of the licensor, except as required for reasonable and customary use in describing the origin of the work and reproducing the content of the NOTICE file.  #### 7. Disclaimer of warranty  Unless required by applicable law or agreed to in writing, the licensor provides the work (and each contributor provides its contributions) on an **\"as is\" basis, without warranties or conditions of any kind**, either express or implied, including, without limitation, any warranties or conditions of **title, non-infringement, merchantability, or fitness for a particular purpose**. You are solely responsible for determining the appropriateness of using or redistributing the work and assume any risks associated with your exercise of permissions under this licence.  #### 8. Limitation of liability  In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any contributor be liable to you for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this licence or out of the use or inability to use the work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such contributor has been advised of the possibility of such damages.  #### 9. Accepting warranty or additional liability  While redistributing the work or derivative works thereof, you may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this licence. However, in accepting such obligations, you may act only on your own behalf and on your sole responsibility, not on behalf of any other contributor, and only if You agree to indemnify, defend, and hold each contributor harmless for any liability incurred by, or claims asserted against, such contributor by reason of your accepting any such warranty or additional liability. ","maintainer":null,"maintainer_email":"pizza1016 <10370007-pizza1016@users.noreply.gitlab.com>","name":"ptv-timetable","package_url":"https://pypi.org/project/ptv-timetable/","platform":null,"project_url":"https://pypi.org/project/ptv-timetable/","project_urls":{"Documentation":"https://gitlab.com/pizza1016/ptv-timetable/-/blob/trunk/README.md","Issues":"https://gitlab.com/pizza1016/ptv-timetable/-/issues","Repository":"https://gitlab.com/pizza1016/ptv-timetable"},"provides_extra":null,"release_url":"https://pypi.org/project/ptv-timetable/0.1.0/","requires_dist":["ratelimit>=2.2.1","requests>=2.32.3","tzdata>=2024.1; platform_system == \"Windows\""],"requires_python":">=3.12","summary":"Python API wrappers to interact with the Public Transport Victoria Timetable API and Yarra Trams TramTracker service","version":"0.1.0","yanked":false,"yanked_reason":null},"last_serial":25464730,"urls":[{"comment_text":"","digests":{"blake2b_256":"c77eb517548a183f4a6026f78234e81c64c15299879f7110db42c4f398425dd8","md5":"7e30422cfda3808d0b8a5ab67f274a57","sha256":"a7fe2b91f9a85f8ab9a51fcde1e86eb9710d1175b63f109a364f294419adbb54"},"downloads":-1,"filename":"ptv_timetable-0.1.0-py3-none-any.whl","has_sig":false,"md5_digest":"7e30422cfda3808d0b8a5ab67f274a57","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.12","size":32417,"upload_time":"2024-07-28T02:10:18","upload_time_iso_8601":"2024-07-28T02:10:18.225112Z","url":"https://files.pythonhosted.org/packages/c7/7e/b517548a183f4a6026f78234e81c64c15299879f7110db42c4f398425dd8/ptv_timetable-0.1.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"eae3aa743fdc7aefceec85d3011cc9f9aae04b6dd6887d4b2759ff2f5c9b0b2a","md5":"b97fc02085f46d5d4ee70cdde641b3d4","sha256":"b2786e8b611540c31c68fbb569aec5f61ce632e9ef1638492128b67c7fca0d46"},"downloads":-1,"filename":"ptv_timetable-0.1.0.tar.gz","has_sig":false,"md5_digest":"b97fc02085f46d5d4ee70cdde641b3d4","packagetype":"sdist","python_version":"source","requires_python":">=3.12","size":36004,"upload_time":"2024-07-28T02:10:20","upload_time_iso_8601":"2024-07-28T02:10:20.095102Z","url":"https://files.pythonhosted.org/packages/ea/e3/aa743fdc7aefceec85d3011cc9f9aae04b6dd6887d4b2759ff2f5c9b0b2a/ptv_timetable-0.1.0.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.1.1":{"info":{"author":null,"author_email":"pizza1016 <10370007-pizza1016@users.noreply.gitlab.com>","bugtrack_url":null,"classifiers":["Development Status :: 3 - Alpha","Intended Audience :: Developers","License :: OSI Approved :: Apache Software License","Operating System :: OS Independent","Programming Language :: Python :: 3","Programming Language :: Python :: 3.12","Programming Language :: Python :: 3.13","Programming Language :: Python :: 3.14","Topic :: Other/Nonlisted Topic","Topic :: Software Development :: Libraries :: Python Modules","Topic :: Utilities","Typing :: Typed"],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":"public transport, transportation, melbourne, victoria, australia, ptv, public transport victoria, yarra trams, library, api wrapper","license":"# Copyright and licensing  The source code in this project is licensed under the Apache Licence, version 2.0, which allows anyone to use, copy, modify and distribute the source code in this project, provided that the licence and any copyright notices, and, where you or someone else has modified one or more files before distribution, a notice stating that that person has changed those files, are distributed with the source code. For convenience, a copy of the licence is provided below these notices.  For this project, a URL to this licence page or the main licence page at https://www.apache.org/licenses/LICENSE-2.0 is sufficient for providing a copy of this licence for the purposes of clause 4(a) of the licence.  **Note that the Apache Licence only applies to the source code and not the data obtained from the APIs.**  Data from the PTV Timetable API is open government data that is separately licensed under the Creative Commons Attribution 4.0 International licence (CC BY 4.0) by the Department of Transport and Planning of Victoria, Australia, which can be found at https://creativecommons.org/licenses/by/4.0/legalcode.en.  Data from the Yarra Trams TramTracker data service is proprietary data by Keolis Downer Rail (KDR) Victoria and their terms of use can be found at https://yarratrams.com.au/terms-conditions.  ---  ## Apache Licence Version 2.0, January 2004<br /> http://www.apache.org/licenses/<br /> This copy of the licence has been edited for style; the original licence terms prevails in the event of any inconsistency.  ### Terms and conditions for use, reproduction and distribution  #### 1. Definitions  In these terms:  - ***licence*** shall mean the terms and conditions for use, reproduction, and distribution as defined by sections 1 through 9 of this document.  - ***licensor*** shall mean the copyright owner or entity authorized by the copyright owner that is granting the licence.  - ***legal entity*** shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means: - (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or - (ii) ownership of fifty percent (50%) or more of the outstanding shares, or - (iii) beneficial ownership of such entity.  - ***you*** (or ***your***) shall mean an individual or legal entity exercising permissions granted by this licence.  - ***source*** form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.  - ***object*** form shall mean any form resulting from mechanical transformation or translation of a source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.  - ***work*** shall mean the work of authorship, whether in source or object form, made available under the licence, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix at https://www.apache.org/licenses/LICENSE-2.0).  - ***derivative works*** shall mean any work, whether in source or object form, that is based on (or derived from) the work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this licence, derivative works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the work and derivative works thereof.  - ***contribution*** shall mean any work of authorship, including the original version of the work and any modifications or additions to that work or derivative works thereof, that is intentionally submitted to licensor for inclusion in the work by the copyright owner or by an individual or legal entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a contribution.\"  - ***contributor*** shall mean licensor and any individual or legal entity on behalf of whom a contribution has been received by licensor and subsequently incorporated within the work.  #### 2. Grant of copyright licence  Subject to the terms and conditions of this licence, each contributor hereby grants to you a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright licence to reproduce, prepare derivative works of, publicly display, publicly perform, sublicense, and distribute the work and such derivative works in source or object form.  #### 3. Grant of patent licence  Subject to the terms and conditions of this licence, each contributor hereby grants to you a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent licence to make, have made, use, offer to sell, sell, import, and otherwise transfer the work, where such licence applies only to those patent claims licensable by such contributor that are necessarily infringed by their contribution(s) alone or by combination of their contribution(s) with the work to which such contribution(s) was submitted. If you institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the work or a contribution incorporated within the work constitutes direct or contributory patent infringement, then any patent licences granted to you under this licence for that work shall terminate as of the date such litigation is filed.  #### 4. Redistribution  You may reproduce and distribute copies of the work or derivative works thereof in any medium, with or without modifications, and in source or object form, provided that you meet the following conditions:  - (a) You must give any other recipients of the work or derivative works a copy of this licence; and - (b) You must cause any modified files to carry prominent notices stating that you changed the files; and - (c) You must retain, in the source form of any derivative works that you distribute, all copyright, patent, trademark, and attribution notices from the source form of the work, excluding those notices that do not pertain to any part of the derivative works; and - (d) If the work includes a \"NOTICE\" text file as part of its distribution, then any derivative works that you distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the derivative works, in at least one of the following places: within a NOTICE text file distributed as part of the derivative works; within the source form or documentation, if provided along with the derivative works; or, within a display generated by the derivative works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the licence. You may add your own attribution notices within derivative works that you distribute, alongside or as an addendum to the NOTICE text from the work, provided that such additional attribution notices cannot be construed as modifying the licence.  You may add your own copyright statement to your modifications and may provide additional or different licence terms and conditions for use, reproduction, or distribution of your modifications, or for any such derivative works as a whole, provided your use, reproduction, and distribution of the work otherwise complies with the conditions stated in this licence.  #### 5. Submission of contributions  Unless you explicitly state otherwise, any contribution intentionally submitted for inclusion in the work by you to the licensor shall be under the terms and conditions of this licence, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate licence agreement you may have executed with licensor regarding such contributions.  #### 6. Trademarks  This licence does not grant permission to use the trade names, trademarks, service marks, or product names of the licensor, except as required for reasonable and customary use in describing the origin of the work and reproducing the content of the NOTICE file.  #### 7. Disclaimer of warranty  Unless required by applicable law or agreed to in writing, the licensor provides the work (and each contributor provides its contributions) on an **\"as is\" basis, without warranties or conditions of any kind**, either express or implied, including, without limitation, any warranties or conditions of **title, non-infringement, merchantability, or fitness for a particular purpose**. You are solely responsible for determining the appropriateness of using or redistributing the work and assume any risks associated with your exercise of permissions under this licence.  #### 8. Limitation of liability  In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any contributor be liable to you for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this licence or out of the use or inability to use the work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such contributor has been advised of the possibility of such damages.  #### 9. Accepting warranty or additional liability  While redistributing the work or derivative works thereof, you may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this licence. However, in accepting such obligations, you may act only on your own behalf and on your sole responsibility, not on behalf of any other contributor, and only if You agree to indemnify, defend, and hold each contributor harmless for any liability incurred by, or claims asserted against, such contributor by reason of your accepting any such warranty or additional liability. ","maintainer":null,"maintainer_email":"pizza1016 <10370007-pizza1016@users.noreply.gitlab.com>","name":"ptv-timetable","package_url":"https://pypi.org/project/ptv-timetable/","platform":null,"project_url":"https://pypi.org/project/ptv-timetable/","project_urls":{"Documentation":"https://gitlab.com/pizza1016/ptv-timetable/-/blob/trunk/README.md","Issues":"https://gitlab.com/pizza1016/ptv-timetable/-/issues","Repository":"https://gitlab.com/pizza1016/ptv-timetable"},"provides_extra":null,"release_url":"https://pypi.org/project/ptv-timetable/0.1.1/","requires_dist":["ratelimit>=2.2.1","requests>=2.32.3","tzdata>=2024.1; platform_system == \"Windows\""],"requires_python":">=3.12","summary":"Python API wrappers to interact with the Public Transport Victoria Timetable API and Yarra Trams TramTracker service","version":"0.1.1","yanked":false,"yanked_reason":null},"last_serial":25464730,"urls":[{"comment_text":"","digests":{"blake2b_256":"87d915769f6c011ceb0618db8bd719a7c92700168f4362cadd0a9c1cd33b8f9e","md5":"debdf9fccba955d3ab2a1856b02eef85","sha256":"604c0905d7ebd5d4d8618f3d8f98189324511509833121b9c147f4bb0f5aa723"},"downloads":-1,"filename":"ptv_timetable-0.1.1-py3-none-any.whl","has_sig":false,"md5_digest":"debdf9fccba955d3ab2a1856b02eef85","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.12","size":32411,"upload_time":"2024-07-28T22:30:39","upload_time_iso_8601":"2024-07-28T22:30:39.942566Z","url":"https://files.pythonhosted.org/packages/87/d9/15769f6c011ceb0618db8bd719a7c92700168f4362cadd0a9c1cd33b8f9e/ptv_timetable-0.1.1-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"85ebb4ff2cda7b241dbb85cf8a9d147f2853db3e5872f30c8ad97206f2b6b915","md5":"165ddb219f1de36e9a2ff706ae6cc481","sha256":"a39ee105d0c51a3d27f30abb888997e2114e80560167bd180b6fead191b20078"},"downloads":-1,"filename":"ptv_timetable-0.1.1.tar.gz","has_sig":false,"md5_digest":"165ddb219f1de36e9a2ff706ae6cc481","packagetype":"sdist","python_version":"source","requires_python":">=3.12","size":35937,"upload_time":"2024-07-28T22:30:42","upload_time_iso_8601":"2024-07-28T22:30:42.242129Z","url":"https://files.pythonhosted.org/packages/85/eb/b4ff2cda7b241dbb85cf8a9d147f2853db3e5872f30c8ad97206f2b6b915/ptv_timetable-0.1.1.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.1.2":{"info":{"author":null,"author_email":"pizza1016 <10370007-pizza1016@users.noreply.gitlab.com>","bugtrack_url":null,"classifiers":["Development Status :: 3 - Alpha","Intended Audience :: Developers","License :: OSI Approved :: Apache Software License","Operating System :: OS Independent","Programming Language :: Python :: 3","Programming Language :: Python :: 3.12","Programming Language :: Python :: 3.13","Programming Language :: Python :: 3.14","Topic :: Other/Nonlisted Topic","Topic :: Software Development :: Libraries :: Python Modules","Topic :: Utilities","Typing :: Typed"],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":"public transport, transportation, melbourne, victoria, australia, ptv, public transport victoria, yarra trams, library, api wrapper","license":"# Copyright and licensing  The source code in this project is licensed under the Apache Licence, version 2.0, which allows anyone to use, copy, modify and distribute the source code in this project, provided that the licence and any copyright notices, and, where you or someone else has modified one or more files before distribution, a notice stating that that person has changed those files, are distributed with the source code. For convenience, a copy of the licence is provided below these notices.  For this project, a URL to this licence page or the main licence page at https://www.apache.org/licenses/LICENSE-2.0 is sufficient for providing a copy of this licence for the purposes of clause 4(a) of the licence.  **Note that the Apache Licence only applies to the source code and not the data obtained from the APIs.**  Data from the PTV Timetable API is open government data that is separately licensed under the Creative Commons Attribution 4.0 International licence (CC BY 4.0) by the Department of Transport and Planning of Victoria, Australia, which can be found at https://creativecommons.org/licenses/by/4.0/legalcode.en.  Data from the Yarra Trams TramTracker data service is proprietary data by Keolis Downer Rail (KDR) Victoria and their terms of use can be found at https://yarratrams.com.au/terms-conditions.  ---  ## Apache Licence Version 2.0, January 2004<br /> http://www.apache.org/licenses/<br /> This copy of the licence has been edited for style; the original licence terms prevails in the event of any inconsistency.  ### Terms and conditions for use, reproduction and distribution  #### 1. Definitions  In these terms:  - ***licence*** shall mean the terms and conditions for use, reproduction, and distribution as defined by sections 1 through 9 of this document.  - ***licensor*** shall mean the copyright owner or entity authorized by the copyright owner that is granting the licence.  - ***legal entity*** shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means: - (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or - (ii) ownership of fifty percent (50%) or more of the outstanding shares, or - (iii) beneficial ownership of such entity.  - ***you*** (or ***your***) shall mean an individual or legal entity exercising permissions granted by this licence.  - ***source*** form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.  - ***object*** form shall mean any form resulting from mechanical transformation or translation of a source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.  - ***work*** shall mean the work of authorship, whether in source or object form, made available under the licence, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix at https://www.apache.org/licenses/LICENSE-2.0).  - ***derivative works*** shall mean any work, whether in source or object form, that is based on (or derived from) the work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this licence, derivative works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the work and derivative works thereof.  - ***contribution*** shall mean any work of authorship, including the original version of the work and any modifications or additions to that work or derivative works thereof, that is intentionally submitted to licensor for inclusion in the work by the copyright owner or by an individual or legal entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a contribution.\"  - ***contributor*** shall mean licensor and any individual or legal entity on behalf of whom a contribution has been received by licensor and subsequently incorporated within the work.  #### 2. Grant of copyright licence  Subject to the terms and conditions of this licence, each contributor hereby grants to you a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright licence to reproduce, prepare derivative works of, publicly display, publicly perform, sublicense, and distribute the work and such derivative works in source or object form.  #### 3. Grant of patent licence  Subject to the terms and conditions of this licence, each contributor hereby grants to you a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent licence to make, have made, use, offer to sell, sell, import, and otherwise transfer the work, where such licence applies only to those patent claims licensable by such contributor that are necessarily infringed by their contribution(s) alone or by combination of their contribution(s) with the work to which such contribution(s) was submitted. If you institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the work or a contribution incorporated within the work constitutes direct or contributory patent infringement, then any patent licences granted to you under this licence for that work shall terminate as of the date such litigation is filed.  #### 4. Redistribution  You may reproduce and distribute copies of the work or derivative works thereof in any medium, with or without modifications, and in source or object form, provided that you meet the following conditions:  - (a) You must give any other recipients of the work or derivative works a copy of this licence; and - (b) You must cause any modified files to carry prominent notices stating that you changed the files; and - (c) You must retain, in the source form of any derivative works that you distribute, all copyright, patent, trademark, and attribution notices from the source form of the work, excluding those notices that do not pertain to any part of the derivative works; and - (d) If the work includes a \"NOTICE\" text file as part of its distribution, then any derivative works that you distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the derivative works, in at least one of the following places: within a NOTICE text file distributed as part of the derivative works; within the source form or documentation, if provided along with the derivative works; or, within a display generated by the derivative works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the licence. You may add your own attribution notices within derivative works that you distribute, alongside or as an addendum to the NOTICE text from the work, provided that such additional attribution notices cannot be construed as modifying the licence.  You may add your own copyright statement to your modifications and may provide additional or different licence terms and conditions for use, reproduction, or distribution of your modifications, or for any such derivative works as a whole, provided your use, reproduction, and distribution of the work otherwise complies with the conditions stated in this licence.  #### 5. Submission of contributions  Unless you explicitly state otherwise, any contribution intentionally submitted for inclusion in the work by you to the licensor shall be under the terms and conditions of this licence, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate licence agreement you may have executed with licensor regarding such contributions.  #### 6. Trademarks  This licence does not grant permission to use the trade names, trademarks, service marks, or product names of the licensor, except as required for reasonable and customary use in describing the origin of the work and reproducing the content of the NOTICE file.  #### 7. Disclaimer of warranty  Unless required by applicable law or agreed to in writing, the licensor provides the work (and each contributor provides its contributions) on an **\"as is\" basis, without warranties or conditions of any kind**, either express or implied, including, without limitation, any warranties or conditions of **title, non-infringement, merchantability, or fitness for a particular purpose**. You are solely responsible for determining the appropriateness of using or redistributing the work and assume any risks associated with your exercise of permissions under this licence.  #### 8. Limitation of liability  In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any contributor be liable to you for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this licence or out of the use or inability to use the work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such contributor has been advised of the possibility of such damages.  #### 9. Accepting warranty or additional liability  While redistributing the work or derivative works thereof, you may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this licence. However, in accepting such obligations, you may act only on your own behalf and on your sole responsibility, not on behalf of any other contributor, and only if You agree to indemnify, defend, and hold each contributor harmless for any liability incurred by, or claims asserted against, such contributor by reason of your accepting any such warranty or additional liability. ","maintainer":null,"maintainer_email":"pizza1016 <10370007-pizza1016@users.noreply.gitlab.com>","name":"ptv-timetable","package_url":"https://pypi.org/project/ptv-timetable/","platform":null,"project_url":"https://pypi.org/project/ptv-timetable/","project_urls":{"Documentation":"https://gitlab.com/pizza1016/ptv-timetable/-/blob/trunk/README.md","Issues":"https://gitlab.com/pizza1016/ptv-timetable/-/issues","Repository":"https://gitlab.com/pizza1016/ptv-timetable"},"provides_extra":null,"release_url":"https://pypi.org/project/ptv-timetable/0.1.2/","requires_dist":["ratelimit>=2.2.1","requests>=2.32.3","tzdata>=2024.1; platform_system == \"Windows\""],"requires_python":">=3.12","summary":"Python API wrappers to interact with the Public Transport Victoria Timetable API and Yarra Trams TramTracker service","version":"0.1.2","yanked":false,"yanked_reason":null},"last_serial":25464730,"urls":[{"comment_text":"","digests":{"blake2b_256":"44ab56c8e4cfd199bd2104a3b206c17528da50159f88ad955a958813d77e72d2","md5":"caa113f5a67948872d78834a3d1ca95e","sha256":"b3443df052b13e57d9467462ff796b8dc00e8f9d904aa87ca4b86c5075bb87be"},"downloads":-1,"filename":"ptv_timetable-0.1.2-py3-none-any.whl","has_sig":false,"md5_digest":"caa113f5a67948872d78834a3d1ca95e","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.12","size":32883,"upload_time":"2024-08-12T12:44:13","upload_time_iso_8601":"2024-08-12T12:44:13.738271Z","url":"https://files.pythonhosted.org/packages/44/ab/56c8e4cfd199bd2104a3b206c17528da50159f88ad955a958813d77e72d2/ptv_timetable-0.1.2-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"d45a7ecbc01ec3a65915bc6d05cd94f742215887b952d7dbb918d3ddf1a465c2","md5":"7148c44873737ed51d87fc784c4cdd02","sha256":"58af0b007a133a79be1c06b7bf36dd2887b07c809e6835a23422a9d1e10aee8d"},"downloads":-1,"filename":"ptv_timetable-0.1.2.tar.gz","has_sig":false,"md5_digest":"7148c44873737ed51d87fc784c4cdd02","packagetype":"sdist","python_version":"source","requires_python":">=3.12","size":36941,"upload_time":"2024-08-12T12:44:15","upload_time_iso_8601":"2024-08-12T12:44:15.722964Z","url":"https://files.pythonhosted.org/packages/d4/5a/7ecbc01ec3a65915bc6d05cd94f742215887b952d7dbb918d3ddf1a465c2/ptv_timetable-0.1.2.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.0":{"info":{"author":null,"author_email":"pizza1016 <10370007-pizza1016@users.noreply.gitlab.com>","bugtrack_url":null,"classifiers":["Development Status :: 3 - Alpha","Intended Audience :: Developers","License :: OSI Approved :: Apache Software License","Operating System :: OS Independent","Programming Language :: Python :: 3","Programming Language :: Python :: 3.12","Programming Language :: Python :: 3.13","Programming Language :: Python :: 3.14","Topic :: Other/Nonlisted Topic","Topic :: Software Development :: Libraries :: Python Modules","Topic :: Utilities","Typing :: Typed"],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":"public transport, transportation, melbourne, victoria, australia, ptv, public transport victoria, yarra trams, library, api wrapper","license":"# Copyright and licensing  The source code in this project is licensed under the Apache Licence, version 2.0, which allows anyone to use, copy, modify and distribute the source code in this project, provided that the licence and any copyright notices, and, where you or someone else has modified one or more files before distribution, a notice stating that that person has changed those files, are distributed with the source code. For convenience, a copy of the licence is provided below these notices.  For this project, a URL to this licence page or the main licence page at https://www.apache.org/licenses/LICENSE-2.0 is sufficient for providing a copy of this licence for the purposes of clause 4(a) of the licence.  **Note that the Apache Licence only applies to the source code and not the data obtained from the APIs.**  Data from the PTV Timetable API is open government data that is separately licensed under the Creative Commons Attribution 4.0 International licence (CC BY 4.0) by the Department of Transport and Planning of Victoria, Australia, which can be found at https://creativecommons.org/licenses/by/4.0/legalcode.en.  Data from the Yarra Trams TramTracker data service is proprietary data by Keolis Downer Rail (KDR) Victoria and their terms of use can be found at https://yarratrams.com.au/terms-conditions.  ---  ## Apache Licence Version 2.0, January 2004<br /> http://www.apache.org/licenses/<br /> This copy of the licence has been edited for style; the original licence terms prevails in the event of any inconsistency.  ### Terms and conditions for use, reproduction and distribution  #### 1. Definitions  In these terms:  - ***licence*** shall mean the terms and conditions for use, reproduction, and distribution as defined by sections 1 through 9 of this document.  - ***licensor*** shall mean the copyright owner or entity authorized by the copyright owner that is granting the licence.  - ***legal entity*** shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means: - (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or - (ii) ownership of fifty percent (50%) or more of the outstanding shares, or - (iii) beneficial ownership of such entity.  - ***you*** (or ***your***) shall mean an individual or legal entity exercising permissions granted by this licence.  - ***source*** form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.  - ***object*** form shall mean any form resulting from mechanical transformation or translation of a source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.  - ***work*** shall mean the work of authorship, whether in source or object form, made available under the licence, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix at https://www.apache.org/licenses/LICENSE-2.0).  - ***derivative works*** shall mean any work, whether in source or object form, that is based on (or derived from) the work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this licence, derivative works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the work and derivative works thereof.  - ***contribution*** shall mean any work of authorship, including the original version of the work and any modifications or additions to that work or derivative works thereof, that is intentionally submitted to licensor for inclusion in the work by the copyright owner or by an individual or legal entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a contribution.\"  - ***contributor*** shall mean licensor and any individual or legal entity on behalf of whom a contribution has been received by licensor and subsequently incorporated within the work.  #### 2. Grant of copyright licence  Subject to the terms and conditions of this licence, each contributor hereby grants to you a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright licence to reproduce, prepare derivative works of, publicly display, publicly perform, sublicense, and distribute the work and such derivative works in source or object form.  #### 3. Grant of patent licence  Subject to the terms and conditions of this licence, each contributor hereby grants to you a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent licence to make, have made, use, offer to sell, sell, import, and otherwise transfer the work, where such licence applies only to those patent claims licensable by such contributor that are necessarily infringed by their contribution(s) alone or by combination of their contribution(s) with the work to which such contribution(s) was submitted. If you institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the work or a contribution incorporated within the work constitutes direct or contributory patent infringement, then any patent licences granted to you under this licence for that work shall terminate as of the date such litigation is filed.  #### 4. Redistribution  You may reproduce and distribute copies of the work or derivative works thereof in any medium, with or without modifications, and in source or object form, provided that you meet the following conditions:  - (a) You must give any other recipients of the work or derivative works a copy of this licence; and - (b) You must cause any modified files to carry prominent notices stating that you changed the files; and - (c) You must retain, in the source form of any derivative works that you distribute, all copyright, patent, trademark, and attribution notices from the source form of the work, excluding those notices that do not pertain to any part of the derivative works; and - (d) If the work includes a \"NOTICE\" text file as part of its distribution, then any derivative works that you distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the derivative works, in at least one of the following places: within a NOTICE text file distributed as part of the derivative works; within the source form or documentation, if provided along with the derivative works; or, within a display generated by the derivative works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the licence. You may add your own attribution notices within derivative works that you distribute, alongside or as an addendum to the NOTICE text from the work, provided that such additional attribution notices cannot be construed as modifying the licence.  You may add your own copyright statement to your modifications and may provide additional or different licence terms and conditions for use, reproduction, or distribution of your modifications, or for any such derivative works as a whole, provided your use, reproduction, and distribution of the work otherwise complies with the conditions stated in this licence.  #### 5. Submission of contributions  Unless you explicitly state otherwise, any contribution intentionally submitted for inclusion in the work by you to the licensor shall be under the terms and conditions of this licence, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate licence agreement you may have executed with licensor regarding such contributions.  #### 6. Trademarks  This licence does not grant permission to use the trade names, trademarks, service marks, or product names of the licensor, except as required for reasonable and customary use in describing the origin of the work and reproducing the content of the NOTICE file.  #### 7. Disclaimer of warranty  Unless required by applicable law or agreed to in writing, the licensor provides the work (and each contributor provides its contributions) on an **\"as is\" basis, without warranties or conditions of any kind**, either express or implied, including, without limitation, any warranties or conditions of **title, non-infringement, merchantability, or fitness for a particular purpose**. You are solely responsible for determining the appropriateness of using or redistributing the work and assume any risks associated with your exercise of permissions under this licence.  #### 8. Limitation of liability  In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any contributor be liable to you for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this licence or out of the use or inability to use the work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such contributor has been advised of the possibility of such damages.  #### 9. Accepting warranty or additional liability  While redistributing the work or derivative works thereof, you may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this licence. However, in accepting such obligations, you may act only on your own behalf and on your sole responsibility, not on behalf of any other contributor, and only if You agree to indemnify, defend, and hold each contributor harmless for any liability incurred by, or claims asserted against, such contributor by reason of your accepting any such warranty or additional liability. ","maintainer":null,"maintainer_email":"pizza1016 <10370007-pizza1016@users.noreply.gitlab.com>","name":"ptv-timetable","package_url":"https://pypi.org/project/ptv-timetable/","platform":null,"project_url":"https://pypi.org/project/ptv-timetable/","project_urls":{"Documentation":"https://gitlab.com/pizza1016/ptv-timetable/-/blob/trunk/README.md","Issues":"https://gitlab.com/pizza1016/ptv-timetable/-/issues","Repository":"https://gitlab.com/pizza1016/ptv-timetable"},"provides_extra":null,"release_url":"https://pypi.org/project/ptv-timetable/0.2.0/","requires_dist":["ratelimit>=2.2.1","requests>=2.32.3","tzdata>=2024.1; platform_system == \"Windows\""],"requires_python":">=3.12","summary":"Python API wrappers to interact with the Public Transport Victoria Timetable API and Yarra Trams TramTracker service","version":"0.2.0","yanked":false,"yanked_reason":null},"last_serial":25464730,"urls":[{"comment_text":"","digests":{"blake2b_256":"f92ffec2bd0893340f4537cca891374f7023b4d8580573bc3d1bfe5945aa7465","md5":"3344661cdd9bab01a0dd2ee44c6ce2cc","sha256":"0518c6e84e1c2543993b8fca9f3fea871ad73c1f5dfcdf45bdbd30eb05358b7a"},"downloads":-1,"filename":"ptv_timetable-0.2.0-py3-none-any.whl","has_sig":false,"md5_digest":"3344661cdd9bab01a0dd2ee44c6ce2cc","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.12","size":34529,"upload_time":"2024-09-01T10:36:54","upload_time_iso_8601":"2024-09-01T10:36:54.003851Z","url":"https://files.pythonhosted.org/packages/f9/2f/fec2bd0893340f4537cca891374f7023b4d8580573bc3d1bfe5945aa7465/ptv_timetable-0.2.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"4b1c6a2cfd07cce965316a05f89b42a3ee48eb598a1a468ad731e44bbbd597c3","md5":"16dfa0009ca4894d12f2dc99c512fab0","sha256":"049562e47306e36da8c3f2c041b2f62813a9cf51a4c712361e4dd6776660c179"},"downloads":-1,"filename":"ptv_timetable-0.2.0.tar.gz","has_sig":false,"md5_digest":"16dfa0009ca4894d12f2dc99c512fab0","packagetype":"sdist","python_version":"source","requires_python":">=3.12","size":37993,"upload_time":"2024-09-01T10:36:56","upload_time_iso_8601":"2024-09-01T10:36:56.457636Z","url":"https://files.pythonhosted.org/packages/4b/1c/6a2cfd07cce965316a05f89b42a3ee48eb598a1a468ad731e44bbbd597c3/ptv_timetable-0.2.0.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.1":{"info":{"author":null,"author_email":"pizza1016 <10370007-pizza1016@users.noreply.gitlab.com>","bugtrack_url":null,"classifiers":["Development Status :: 3 - Alpha","Intended Audience :: Developers","License :: OSI Approved :: Apache Software License","Operating System :: OS Independent","Programming Language :: Python :: 3","Programming Language :: Python :: 3.12","Programming Language :: Python :: 3.13","Programming Language :: Python :: 3.14","Topic :: Other/Nonlisted Topic","Topic :: Software Development :: Libraries :: Python Modules","Topic :: Utilities","Typing :: Typed"],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":"public transport, transportation, melbourne, victoria, australia, ptv, public transport victoria, yarra trams, library, api wrapper","license":"# Copyright and licensing  The source code in this project is licensed under the Apache Licence, version 2.0, which allows anyone to use, copy, modify and distribute the source code in this project, provided that the licence and any copyright notices, and, where you or someone else has modified one or more files before distribution, a notice stating that that person has changed those files, are distributed with the source code. For convenience, a copy of the licence is provided below these notices.  For the purposes of clause 4(a) of the licence for this project, the contributors deem it sufficient for a URL or hyperlink to this licence page or the main licence page at https://www.apache.org/licenses/LICENSE-2.0 to be provided in lieu of the full text of the licence.  **Note that the Apache Licence only applies to the source code and not the data obtained from the APIs.**  Data from the PTV Timetable API is open government data that is separately licensed under the Creative Commons Attribution 4.0 International licence (CC BY 4.0) by the Department of Transport and Planning of Victoria, Australia, which can be found at https://creativecommons.org/licenses/by/4.0/legalcode.en.  Data from the Yarra Trams TramTracker data service is proprietary data by Keolis Downer Rail (KDR) Victoria and their terms of use can be found at https://yarratrams.com.au/terms-conditions.  ---  ## Apache Licence Version 2.0, January 2004<br /> http://www.apache.org/licenses/<br /> This copy of the licence has been edited for style; the original licence terms prevails in the event of any inconsistency.  ### Terms and conditions for use, reproduction and distribution  #### 1. Definitions  In these terms:  - ***licence*** shall mean the terms and conditions for use, reproduction, and distribution as defined by sections 1 through 9 of this document.  - ***licensor*** shall mean the copyright owner or entity authorized by the copyright owner that is granting the licence.  - ***legal entity*** shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means: - (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or - (ii) ownership of fifty percent (50%) or more of the outstanding shares, or - (iii) beneficial ownership of such entity.  - ***you*** (or ***your***) shall mean an individual or legal entity exercising permissions granted by this licence.  - ***source*** form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.  - ***object*** form shall mean any form resulting from mechanical transformation or translation of a source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.  - ***work*** shall mean the work of authorship, whether in source or object form, made available under the licence, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix at https://www.apache.org/licenses/LICENSE-2.0).  - ***derivative works*** shall mean any work, whether in source or object form, that is based on (or derived from) the work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this licence, derivative works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the work and derivative works thereof.  - ***contribution*** shall mean any work of authorship, including the original version of the work and any modifications or additions to that work or derivative works thereof, that is intentionally submitted to licensor for inclusion in the work by the copyright owner or by an individual or legal entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a contribution.\"  - ***contributor*** shall mean licensor and any individual or legal entity on behalf of whom a contribution has been received by licensor and subsequently incorporated within the work.  #### 2. Grant of copyright licence  Subject to the terms and conditions of this licence, each contributor hereby grants to you a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright licence to reproduce, prepare derivative works of, publicly display, publicly perform, sublicense, and distribute the work and such derivative works in source or object form.  #### 3. Grant of patent licence  Subject to the terms and conditions of this licence, each contributor hereby grants to you a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent licence to make, have made, use, offer to sell, sell, import, and otherwise transfer the work, where such licence applies only to those patent claims licensable by such contributor that are necessarily infringed by their contribution(s) alone or by combination of their contribution(s) with the work to which such contribution(s) was submitted. If you institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the work or a contribution incorporated within the work constitutes direct or contributory patent infringement, then any patent licences granted to you under this licence for that work shall terminate as of the date such litigation is filed.  #### 4. Redistribution  You may reproduce and distribute copies of the work or derivative works thereof in any medium, with or without modifications, and in source or object form, provided that you meet the following conditions:  - (a) You must give any other recipients of the work or derivative works a copy of this licence; and - (b) You must cause any modified files to carry prominent notices stating that you changed the files; and - (c) You must retain, in the source form of any derivative works that you distribute, all copyright, patent, trademark, and attribution notices from the source form of the work, excluding those notices that do not pertain to any part of the derivative works; and - (d) If the work includes a \"NOTICE\" text file as part of its distribution, then any derivative works that you distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the derivative works, in at least one of the following places: within a NOTICE text file distributed as part of the derivative works; within the source form or documentation, if provided along with the derivative works; or, within a display generated by the derivative works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the licence. You may add your own attribution notices within derivative works that you distribute, alongside or as an addendum to the NOTICE text from the work, provided that such additional attribution notices cannot be construed as modifying the licence.  You may add your own copyright statement to your modifications and may provide additional or different licence terms and conditions for use, reproduction, or distribution of your modifications, or for any such derivative works as a whole, provided your use, reproduction, and distribution of the work otherwise complies with the conditions stated in this licence.  #### 5. Submission of contributions  Unless you explicitly state otherwise, any contribution intentionally submitted for inclusion in the work by you to the licensor shall be under the terms and conditions of this licence, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate licence agreement you may have executed with licensor regarding such contributions.  #### 6. Trademarks  This licence does not grant permission to use the trade names, trademarks, service marks, or product names of the licensor, except as required for reasonable and customary use in describing the origin of the work and reproducing the content of the NOTICE file.  #### 7. Disclaimer of warranty  Unless required by applicable law or agreed to in writing, the licensor provides the work (and each contributor provides its contributions) on an **\"as is\" basis, without warranties or conditions of any kind**, either express or implied, including, without limitation, any warranties or conditions of **title, non-infringement, merchantability, or fitness for a particular purpose**. You are solely responsible for determining the appropriateness of using or redistributing the work and assume any risks associated with your exercise of permissions under this licence.  #### 8. Limitation of liability  In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any contributor be liable to you for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this licence or out of the use or inability to use the work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such contributor has been advised of the possibility of such damages.  #### 9. Accepting warranty or additional liability  While redistributing the work or derivative works thereof, you may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this licence. However, in accepting such obligations, you may act only on your own behalf and on your sole responsibility, not on behalf of any other contributor, and only if You agree to indemnify, defend, and hold each contributor harmless for any liability incurred by, or claims asserted against, such contributor by reason of your accepting any such warranty or additional liability. ","maintainer":null,"maintainer_email":"pizza1016 <10370007-pizza1016@users.noreply.gitlab.com>","name":"ptv-timetable","package_url":"https://pypi.org/project/ptv-timetable/","platform":null,"project_url":"https://pypi.org/project/ptv-timetable/","project_urls":{"Documentation":"https://gitlab.com/pizza1016/ptv-timetable/-/blob/trunk/README.md","Issues":"https://gitlab.com/pizza1016/ptv-timetable/-/issues","Repository":"https://gitlab.com/pizza1016/ptv-timetable"},"provides_extra":null,"release_url":"https://pypi.org/project/ptv-timetable/0.2.1/","requires_dist":["ratelimit>=2.2.1","requests>=2.32.3","tzdata>=2024.1; platform_system == \"Windows\""],"requires_python":">=3.12","summary":"Python API wrappers to interact with the Public Transport Victoria Timetable API and Yarra Trams TramTracker service","version":"0.2.1","yanked":false,"yanked_reason":null},"last_serial":25464730,"urls":[{"comment_text":"","digests":{"blake2b_256":"7598aef865afd89bbf99100e42f816d0db6bc27666817372031b02b298d214ec","md5":"9dec7760b4b805ee44fe587efaede057","sha256":"8570e757e22012ca1d2f3e8ce1292340f19e02f9fde39613c690b7db377834b3"},"downloads":-1,"filename":"ptv_timetable-0.2.1-py3-none-any.whl","has_sig":false,"md5_digest":"9dec7760b4b805ee44fe587efaede057","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.12","size":35864,"upload_time":"2024-10-14T03:42:21","upload_time_iso_8601":"2024-10-14T03:42:21.158922Z","url":"https://files.pythonhosted.org/packages/75/98/aef865afd89bbf99100e42f816d0db6bc27666817372031b02b298d214ec/ptv_timetable-0.2.1-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"b9ef47ecef2270611f80bc8202b32d3b5ee9f14af965a75ecc6906e5a65f2cfc","md5":"5988bfb8d055d9af01d7485a128f6d09","sha256":"db32fc494ddbe83be33c25133a7ad7b3957196018e83ab089fb1c9ddacce0438"},"downloads":-1,"filename":"ptv_timetable-0.2.1.tar.gz","has_sig":false,"md5_digest":"5988bfb8d055d9af01d7485a128f6d09","packagetype":"sdist","python_version":"source","requires_python":">=3.12","size":39501,"upload_time":"2024-10-14T03:42:22","upload_time_iso_8601":"2024-10-14T03:42:22.626719Z","url":"https://files.pythonhosted.org/packages/b9/ef/47ecef2270611f80bc8202b32d3b5ee9f14af965a75ecc6906e5a65f2cfc/ptv_timetable-0.2.1.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]}}