{"0.0.1.dev0":{"info":{"author":null,"author_email":null,"bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","License :: Public Domain"],"description_content_type":null,"docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"I, Philippe Gaborit, University of Limoges, 123 av. A. Thomas, 87000 Limoges France am the owner of the following patents and/or patent applications: “Cryptographic method for communicating confidential information” US9094189 B2, and “Procédé cryptographique de communication d'une information confidentielle” FR 10/51190, and do hereby commit and agree to grant to any interested party on a worldwide basis, if the cryptosystem known as, HQC is selected for standardization, in consideration of its evaluation and selection by NIST, a non- exclusive license for the purpose of implementing the standard:  without compensation, and under reasonable terms and conditions that are demonstrably free of any unfair discrimination.  I further do hereby commit and agree to license such party on the same basis with respect to any other patent application or patent hereafter granted to me, or owned or controlled by me, that is or may be necessary for the purpose of implementing the standard.  I further do hereby commit and agree that I will include, in any documents transferring ownership of each patent and patent application, provisions to ensure that the commitments and assurances made by me are binding on the transferee and any future transferee.  I further do hereby commit and agree that these commitments and assurances are intended by me to be binding on successors-in-interest of each patent and patent application, regardless of whether such provisions are included in the relevant transfer documents.  I further do hereby grant to the U.S. Government, during the public review and the evaluation process, and during the lifetime of the standard, a nonexclusive, nontransferrable, irrevocable, paid-up worldwide license solely for the purpose of modifying my submitted cryptosystem’s specifications (e.g., to protect against a newly discovered vulnerability) for incorporation into the standard.  -----  I, Carlos Aguilar Melchor, of ENSEEIHT, 2 rue Charles Camichel, 31000 Tolouse, FRANCE am the owner of the following patents and/or patent applications: “Cryptographic method for communicating confidential information” US9094189 B2, and “Procédé cryptographique de communication d'une information confidentielle” FR 10/51190, and do hereby commit and agree to grant to any interested party on a worldwide basis, if the cryptosystem known as, HQC, is selected for standardization, in consideration of its evaluation and selection by NIST, a non- exclusive license for the purpose of implementing the standard:  without compensation, and under reasonable terms and conditions that are demonstrably free of any unfair discrimination.  I further do hereby commit and agree to license such party on the same basis with respect to any other patent application or patent hereafter granted to me, or owned or controlled by me, that is or may be necessary for the purpose of implementing the standard.  I further do hereby commit and agree that I will include, in any documents transferring ownership of each patent and patent application, provisions to ensure that the commitments and assurances made by me are binding on the transferee and any future transferee.  I further do hereby commit and agree that these commitments and assurances are intended by me to be binding on successors-in-interest of each patent and patent application, regardless of whether such provisions are included in the relevant transfer documents.  I further do hereby grant to the U.S. Government, during the public review and the evaluation process, and during the lifetime of the standard, a nonexclusive, nontransferrable, irrevocable, paid-up worldwide license solely for the purpose of modifying my submitted cryptosystem’s specifications (e.g., to protect against a newly discovered vulnerability) for incorporation into the standard.  -----  I, Marion BLIN, interim Regional Delegate of CENTRE NATIONAL DE LA RECHERCHE SCIENTIFIQUE, 3 rue Michel Ange, 75794 PARIS cedex 19 FRANCE, am the authorized representative of the owner of the following patent(s) and/or patent application(s):  - French Priority Patent: Procédé cryptographique de communication d’une information confidentielle, FR 10/51190, February 18th, 2010, and its validated extensions in France, in Germany, in Swiss, in United Kingdom, United States, and in Japan,  and do hereby commit and agree to grant to any interested party on a worldwide basis, if the cryptosystem known as HQC is selected for standardization, in consideration of its evaluation and selection by NIST, a non-exclusive license for the purpose of implementing the standard:  without compensation and under reasonable terms and conditions that are demon- strably free of any unfair discrimination.  I further do hereby commit and agree to license such party on the same basis with respect to any other patent application or patent hereafter granted to me, or owned or controlled by me, that is or may be necessary for the purpose of implementing the standard.  I further do hereby commit and agree that I will include, in any documents transferring ownership of each patent and patent application, provisions to ensure that the commitments and assurances made by me are binding on the transferee and any future transferee.  I further do hereby commit and agree that these commitments and assurances are in- tended by me to be binding on successors-in- interest of each patent and patent application, regardless of whether such provisions are included in the relevant transfer documents.  I further do hereby grant to the U.S. Government, during the public review and the evaluation process, and during the lifetime of the standard, a nonexclusive, nontransferrable, irrevocable, paid-up worldwide license solely for the purpose of modifying my submitted cryptosystem’s specifications (e.g., to protect against a newly discovered vulnerability) for incorporation into the standard. ","maintainer":null,"maintainer_email":null,"name":"pypqc-cffi-bindings-hqc","package_url":"https://pypi.org/project/pypqc-cffi-bindings-hqc/","platform":null,"project_url":"https://pypi.org/project/pypqc-cffi-bindings-hqc/","project_urls":null,"provides_extra":null,"release_url":"https://pypi.org/project/pypqc-cffi-bindings-hqc/0.0.1.dev0/","requires_dist":["cffi>=1.0.0; platform_python_implementation != \"PyPy\""],"requires_python":null,"summary":null,"version":"0.0.1.dev0","yanked":false,"yanked_reason":null},"last_serial":24859874,"urls":[{"comment_text":"","digests":{"blake2b_256":"e0b68977acfd74b9b03fa8e296fdccc674dc811fa7d02c7df08f51abf7ad4f57","md5":"ac4ba4b0323672a85294e6f589b7b7ca","sha256":"a9aa3fde7270103dee39c025cb6210cc8bff97518e2b73cf59417c25da5a8616"},"downloads":-1,"filename":"pypqc_cffi_bindings_hqc-0.0.1.dev0.tar.gz","has_sig":false,"md5_digest":"ac4ba4b0323672a85294e6f589b7b7ca","packagetype":"sdist","python_version":"source","requires_python":null,"size":98175,"upload_time":"2024-09-03T15:30:00","upload_time_iso_8601":"2024-09-03T15:30:00.449300Z","url":"https://files.pythonhosted.org/packages/e0/b6/8977acfd74b9b03fa8e296fdccc674dc811fa7d02c7df08f51abf7ad4f57/pypqc_cffi_bindings_hqc-0.0.1.dev0.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]}}