{"0.0.1.dev0":{"info":{"author":null,"author_email":null,"bugtrack_url":null,"classifiers":["License :: OSI Approved :: MIT License","License :: Other/Proprietary License"],"description_content_type":null,"docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"I, William Whyte, of 187 Ballardvale St. Suite A202, Wilmington MA 01803, U.S., am the owner or au- thorized representative of the owner, OnBoard Security, of the following patent(s) and/or patent applica- tions(s): US 7308097 B2 (“Digital signature and authentication method and apparatus”), and do hereby commit and agree to grant to any interested party on a worldwide basis, if the cryptosystem known as Falcon is selected for standardization, in consideration of its evaluation and selection by NIST, a non- exclusive license for the purpose of implementing the standard:  without compensation and under reasonable terms and conditions that are demonstrably free of any unfair discrimination.  I further do hereby commit and agree to license such party on the same basis with respect to any other patent application or patent hereafter granted to me, or owned or controlled by me, that is or may be necessary for the purpose of implementing the standard.  I further do hereby commit and agree that I will include, in any documents transferring ownership of each patent and patent application, provisions to ensure that the commitments and assurances made by me are binding on the transferee and any future transferee.  I further do hereby commit and agree that these commitments and assurances are intended by me to be binding on successors-in-interest of each patent and patent application, regardless of whether such provisions are included in the relevant transfer documents.  I further do hereby grant to the U.S. Government, during the public review and the evaluation process, and during the lifetime of the standard, a nonexclusive, nontransferrable, irrevocable, paid-up worldwide license solely for the purpose of modifying my submitted cryptosystem’s specifications (e.g., to protect against a newly discovered vulnerability) for incorporation into the standard. ","maintainer":null,"maintainer_email":null,"name":"pypqc-cffi-bindings-falcon","package_url":"https://pypi.org/project/pypqc-cffi-bindings-falcon/","platform":null,"project_url":"https://pypi.org/project/pypqc-cffi-bindings-falcon/","project_urls":null,"provides_extra":null,"release_url":"https://pypi.org/project/pypqc-cffi-bindings-falcon/0.0.1.dev0/","requires_dist":["cffi>=1.0.0; platform_python_implementation != \"PyPy\""],"requires_python":null,"summary":null,"version":"0.0.1.dev0","yanked":false,"yanked_reason":null},"last_serial":24859870,"urls":[{"comment_text":"","digests":{"blake2b_256":"da644c856882d0ac2fb352e985c19a614377ad72d1b90476c9773e2d5954d193","md5":"75d9ce8f35a8b5b4a32b8d267370e4df","sha256":"f8f6a29efd11976941ccdb8e264fbc2fb34f903b061d996db352c332edde56fc"},"downloads":-1,"filename":"pypqc_cffi_bindings_falcon-0.0.1.dev0.tar.gz","has_sig":false,"md5_digest":"75d9ce8f35a8b5b4a32b8d267370e4df","packagetype":"sdist","python_version":"source","requires_python":null,"size":464847,"upload_time":"2024-09-03T15:29:57","upload_time_iso_8601":"2024-09-03T15:29:57.247617Z","url":"https://files.pythonhosted.org/packages/da/64/4c856882d0ac2fb352e985c19a614377ad72d1b90476c9773e2d5954d193/pypqc_cffi_bindings_falcon-0.0.1.dev0.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]}}