{"2023.10.10":{"info":{"author":"Masashi Nogawa","author_email":"","bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":"","downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"","keywords":"QSPICE,Qorvo,SPICE,LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":"","maintainer_email":"","name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2023.10.10/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2023.10.10","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"c5171b02c61facfe579529961f0631606dd6c3c6528a930fad080e440e527c25","md5":"deeab21d25d224e319d10dfa308fbed3","sha256":"078db8de52e66b1b928a8018174d57d26c537c232ff80447b8df0365d5617f23"},"downloads":-1,"filename":"PyQSPICE-2023.10.10-py3-none-any.whl","has_sig":false,"md5_digest":"deeab21d25d224e319d10dfa308fbed3","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":16190,"upload_time":"2023-10-10T14:47:49","upload_time_iso_8601":"2023-10-10T14:47:49.780729Z","url":"https://files.pythonhosted.org/packages/c5/17/1b02c61facfe579529961f0631606dd6c3c6528a930fad080e440e527c25/PyQSPICE-2023.10.10-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"a6a8fc581675a6679ed2ff0f88d4f28e0296cfcbb3c7fe2ed1c2dd7d4d4eb023","md5":"71145ce83b360dfd44b4a1ee354b3dea","sha256":"35cd3b481899c243714580327639ec137fbd889aa160c13b828d9c0bb349cca0"},"downloads":-1,"filename":"PyQSPICE-2023.10.10.tar.gz","has_sig":false,"md5_digest":"71145ce83b360dfd44b4a1ee354b3dea","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":17014,"upload_time":"2023-10-10T14:47:50","upload_time_iso_8601":"2023-10-10T14:47:50.845008Z","url":"https://files.pythonhosted.org/packages/a6/a8/fc581675a6679ed2ff0f88d4f28e0296cfcbb3c7fe2ed1c2dd7d4d4eb023/PyQSPICE-2023.10.10.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"2023.10.29":{"info":{"author":"Masashi Nogawa","author_email":"","bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":"","downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"","keywords":"QSPICE,Qorvo,SPICE,LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":"","maintainer_email":"","name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2023.10.29/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2023.10.29","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"479c67af75f038e23a5109013d48f1a23484ad2179bc0990a4cd64337edab2df","md5":"68ddccfc142cd9166a640abbe6f3315b","sha256":"025499940cd7422a2c7adbcab955ad6bfb14140246364f98ce7c5c6d44862e4e"},"downloads":-1,"filename":"PyQSPICE-2023.10.29-py3-none-any.whl","has_sig":false,"md5_digest":"68ddccfc142cd9166a640abbe6f3315b","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":17260,"upload_time":"2023-10-29T14:46:41","upload_time_iso_8601":"2023-10-29T14:46:41.251305Z","url":"https://files.pythonhosted.org/packages/47/9c/67af75f038e23a5109013d48f1a23484ad2179bc0990a4cd64337edab2df/PyQSPICE-2023.10.29-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"89daad6a315df8e14180708303ae9e433eac37a4cf5554db2fe88ef1693bde47","md5":"b5404fdaaa42ac614da074972fe762f0","sha256":"c81e86f4f3a9502173ab8fb0983b2056a32c6c47abb1b147f074755abb950830"},"downloads":-1,"filename":"PyQSPICE-2023.10.29.tar.gz","has_sig":false,"md5_digest":"b5404fdaaa42ac614da074972fe762f0","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":18305,"upload_time":"2023-10-29T14:46:42","upload_time_iso_8601":"2023-10-29T14:46:42.717014Z","url":"https://files.pythonhosted.org/packages/89/da/ad6a315df8e14180708303ae9e433eac37a4cf5554db2fe88ef1693bde47/PyQSPICE-2023.10.29.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"2023.10.30":{"info":{"author":"Masashi Nogawa","author_email":"","bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":"","downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"","keywords":"QSPICE,Qorvo,SPICE,LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":"","maintainer_email":"","name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2023.10.30/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2023.10.30","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"30e69bec07b16e2864504b33bfebabff8a36607119e7d7518ccddb4f765b1574","md5":"6524c7ade6c1e0fbd65455e1da546c4c","sha256":"baf13b97990b7664bdafa746f602f5e9c7102f9953d5b1a1939b818d3e2a7918"},"downloads":-1,"filename":"PyQSPICE-2023.10.30-py3-none-any.whl","has_sig":false,"md5_digest":"6524c7ade6c1e0fbd65455e1da546c4c","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":17560,"upload_time":"2023-10-30T14:21:36","upload_time_iso_8601":"2023-10-30T14:21:36.112912Z","url":"https://files.pythonhosted.org/packages/30/e6/9bec07b16e2864504b33bfebabff8a36607119e7d7518ccddb4f765b1574/PyQSPICE-2023.10.30-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"4c347331212cdee3f32bc34b1046477a027429e1e174f581212f589b6aeb631e","md5":"ea759e5e1a9303b784e281d960f7cf47","sha256":"b9284b5db14e10447a368fc17d782ec22bc434de0c6b18dc1b10291c7bb90cd6"},"downloads":-1,"filename":"PyQSPICE-2023.10.30.tar.gz","has_sig":false,"md5_digest":"ea759e5e1a9303b784e281d960f7cf47","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":19026,"upload_time":"2023-10-30T14:21:37","upload_time_iso_8601":"2023-10-30T14:21:37.691037Z","url":"https://files.pythonhosted.org/packages/4c/34/7331212cdee3f32bc34b1046477a027429e1e174f581212f589b6aeb631e/PyQSPICE-2023.10.30.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"2023.10.8":{"info":{"author":"Masashi Nogawa","author_email":"","bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":"","downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"","keywords":"QSPICE,Qorvo,SPICE,LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":"","maintainer_email":"","name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2023.10.8/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2023.10.8","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"102a5c36aa99081730c37cbd3dfe054053b8440dd5a4a8be0e5e367bf207f2d4","md5":"c8071f1b1309e522b5d35ed7acefb2ef","sha256":"bcf411baa969c8657f9e48ed6ab77a161a525eea977bd3da6c1495ae547714e1"},"downloads":-1,"filename":"PyQSPICE-2023.10.8-py3-none-any.whl","has_sig":false,"md5_digest":"c8071f1b1309e522b5d35ed7acefb2ef","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":16128,"upload_time":"2023-10-08T19:54:49","upload_time_iso_8601":"2023-10-08T19:54:49.340489Z","url":"https://files.pythonhosted.org/packages/10/2a/5c36aa99081730c37cbd3dfe054053b8440dd5a4a8be0e5e367bf207f2d4/PyQSPICE-2023.10.8-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"66f0d146a8e353d40d2d454c90dfa06c84e099c445834e6651be4c119e155b2c","md5":"dd86d3675f92a3adb0076b533fb66435","sha256":"3c2f25a13922e851bb03ea8e9aed6a91c808bd729476eb926fc9d5614e198d53"},"downloads":-1,"filename":"PyQSPICE-2023.10.8.tar.gz","has_sig":false,"md5_digest":"dd86d3675f92a3adb0076b533fb66435","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":16987,"upload_time":"2023-10-08T19:54:50","upload_time_iso_8601":"2023-10-08T19:54:50.713004Z","url":"https://files.pythonhosted.org/packages/66/f0/d146a8e353d40d2d454c90dfa06c84e099c445834e6651be4c119e155b2c/PyQSPICE-2023.10.8.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"2023.11.20":{"info":{"author":"Masashi Nogawa","author_email":"","bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":"","downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"","keywords":"QSPICE,Qorvo,SPICE,LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":"","maintainer_email":"","name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2023.11.20/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2023.11.20","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"c09e202c4eb0e73ea51cf6dbdd086ac9a93b4cc9daae96b523c2d8b225c2bd90","md5":"879f6c79dc99e996ee2e0aefbf6fbe43","sha256":"885599d9cc0843e163b5e3db79ff2d231a479e8c34db684059b4771618ade659"},"downloads":-1,"filename":"PyQSPICE-2023.11.20-py3-none-any.whl","has_sig":false,"md5_digest":"879f6c79dc99e996ee2e0aefbf6fbe43","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":18363,"upload_time":"2023-11-20T21:58:29","upload_time_iso_8601":"2023-11-20T21:58:29.743643Z","url":"https://files.pythonhosted.org/packages/c0/9e/202c4eb0e73ea51cf6dbdd086ac9a93b4cc9daae96b523c2d8b225c2bd90/PyQSPICE-2023.11.20-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"2960c77d326cd7fbd2e83653c144e351cb01e09048539c88e786ca402446702d","md5":"12d5871f30f3677f548af4247e6cd9dd","sha256":"20d76e0b1bfa80197ae06dcffe815a52a09b666a8256b4a9b9c859fa51ca1734"},"downloads":-1,"filename":"PyQSPICE-2023.11.20.tar.gz","has_sig":false,"md5_digest":"12d5871f30f3677f548af4247e6cd9dd","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":19840,"upload_time":"2023-11-20T21:58:30","upload_time_iso_8601":"2023-11-20T21:58:30.834496Z","url":"https://files.pythonhosted.org/packages/29/60/c77d326cd7fbd2e83653c144e351cb01e09048539c88e786ca402446702d/PyQSPICE-2023.11.20.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"2023.11.29":{"info":{"author":"Masashi Nogawa","author_email":"","bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":"","downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"","keywords":"QSPICE,Qorvo,SPICE,LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":"","maintainer_email":"","name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2023.11.29/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2023.11.29","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"3a6ef58dcb001383bafd8c9ba0ce16e7a1e40f43f8b9b19eab8ffa20254e7fff","md5":"b020597a237bc1480f0f51d0ab271253","sha256":"fbd49216ccadb0772b93994ca3ff5a7ef72f235aab295a86c51c2f1946f4699b"},"downloads":-1,"filename":"PyQSPICE-2023.11.29-py3-none-any.whl","has_sig":false,"md5_digest":"b020597a237bc1480f0f51d0ab271253","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":19711,"upload_time":"2023-11-30T01:56:04","upload_time_iso_8601":"2023-11-30T01:56:04.856056Z","url":"https://files.pythonhosted.org/packages/3a/6e/f58dcb001383bafd8c9ba0ce16e7a1e40f43f8b9b19eab8ffa20254e7fff/PyQSPICE-2023.11.29-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"eede7772eb239b917f3fb938a1a1c08bcef3f23f0af38a15031f9730e6adbe78","md5":"010b1f22d173503d27ed63f7582c9bfe","sha256":"7269b106b14c338666b240e1cb39b6c3b3ac42b6f904c34032351a8c92796a71"},"downloads":-1,"filename":"PyQSPICE-2023.11.29.tar.gz","has_sig":false,"md5_digest":"010b1f22d173503d27ed63f7582c9bfe","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":21355,"upload_time":"2023-11-30T01:56:06","upload_time_iso_8601":"2023-11-30T01:56:06.347981Z","url":"https://files.pythonhosted.org/packages/ee/de/7772eb239b917f3fb938a1a1c08bcef3f23f0af38a15031f9730e6adbe78/PyQSPICE-2023.11.29.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"2023.12.11":{"info":{"author":"Masashi Nogawa","author_email":"","bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":"","downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"","keywords":"QSPICE,Qorvo,SPICE,LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":"","maintainer_email":"","name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2023.12.11/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2023.12.11","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"7f2f4232f7e2970ce9f16804d24b55e053e251186676ec0965f9502bf63aaef8","md5":"132d4f2e9e6c19ea7fbd93b8b96725b8","sha256":"24c5737aff8781ea5a453cc103d2ae3162d239df09e937710460c25f583a5b25"},"downloads":-1,"filename":"PyQSPICE-2023.12.11-py3-none-any.whl","has_sig":false,"md5_digest":"132d4f2e9e6c19ea7fbd93b8b96725b8","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":21055,"upload_time":"2023-12-12T01:14:10","upload_time_iso_8601":"2023-12-12T01:14:10.622952Z","url":"https://files.pythonhosted.org/packages/7f/2f/4232f7e2970ce9f16804d24b55e053e251186676ec0965f9502bf63aaef8/PyQSPICE-2023.12.11-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"24efb5c48a2a950cb19131903c1c77da42df6283517d8fe884b27ac635bb6908","md5":"6a620aceb9367de93abcab4800239b71","sha256":"9278be41e9b60fd248061634c9006752a0a0dbf0e82c27e520903be19983bba4"},"downloads":-1,"filename":"PyQSPICE-2023.12.11.tar.gz","has_sig":false,"md5_digest":"6a620aceb9367de93abcab4800239b71","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":22656,"upload_time":"2023-12-12T01:14:12","upload_time_iso_8601":"2023-12-12T01:14:12.711747Z","url":"https://files.pythonhosted.org/packages/24/ef/b5c48a2a950cb19131903c1c77da42df6283517d8fe884b27ac635bb6908/PyQSPICE-2023.12.11.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"2024.1.3":{"info":{"author":"Masashi Nogawa","author_email":"","bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":"","downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"","keywords":"QSPICE,Qorvo,SPICE,LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":"","maintainer_email":"","name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2024.1.3/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2024.1.3","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"fe987a921c540dc8cd96c9fe0a4aae95bfed82f2c2ebbe2af37a3822b4abbfaf","md5":"50a002cd606e971a294623fc30147e27","sha256":"38f0ad0cb68d0e84e5c928d849624f267edff8f56660fbd6f0ee802ba6d02d5e"},"downloads":-1,"filename":"PyQSPICE-2024.1.3-py3-none-any.whl","has_sig":false,"md5_digest":"50a002cd606e971a294623fc30147e27","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":21111,"upload_time":"2024-01-03T14:25:31","upload_time_iso_8601":"2024-01-03T14:25:31.498246Z","url":"https://files.pythonhosted.org/packages/fe/98/7a921c540dc8cd96c9fe0a4aae95bfed82f2c2ebbe2af37a3822b4abbfaf/PyQSPICE-2024.1.3-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"eeee9dba08f5b4cd43c3cfd41867ef532ca956ba0810538f3dd70e1305c8d819","md5":"9eda7c6a7e51dcc30670a81442a7a1a7","sha256":"0c1e6696a5abb3b20c9f0d042aedabcfaf8ccd1038fa5bab22096e172a0f3e4f"},"downloads":-1,"filename":"PyQSPICE-2024.1.3.tar.gz","has_sig":false,"md5_digest":"9eda7c6a7e51dcc30670a81442a7a1a7","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":22755,"upload_time":"2024-01-03T14:25:32","upload_time_iso_8601":"2024-01-03T14:25:32.619462Z","url":"https://files.pythonhosted.org/packages/ee/ee/9dba08f5b4cd43c3cfd41867ef532ca956ba0810538f3dd70e1305c8d819/PyQSPICE-2024.1.3.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"2024.2.19":{"info":{"author":"Masashi Nogawa","author_email":"","bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":"","downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"","keywords":"QSPICE,Qorvo,SPICE,LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":"","maintainer_email":"","name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2024.2.19/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2024.2.19","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"9e9189aea075f2708096104d4ef8f7130d8bfca6ec19744dd6437cec9dfd5ae2","md5":"6e7f909011c3efd0b867ee121816b9db","sha256":"3657784b9e55dff6b5ab7560198e469b266077ff12404c17e25de3c2fc6a555f"},"downloads":-1,"filename":"PyQSPICE-2024.2.19-py3-none-any.whl","has_sig":false,"md5_digest":"6e7f909011c3efd0b867ee121816b9db","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":21135,"upload_time":"2024-02-19T17:46:27","upload_time_iso_8601":"2024-02-19T17:46:27.305499Z","url":"https://files.pythonhosted.org/packages/9e/91/89aea075f2708096104d4ef8f7130d8bfca6ec19744dd6437cec9dfd5ae2/PyQSPICE-2024.2.19-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"512586225f53a4a85d09b326995361d7fff6a2bc7956aeb3503825fe74701f68","md5":"845f4a85523767a5c427e4f37ebfef6b","sha256":"aa9076fd5d252994c6235d0df48401a57d1dd541d66e0d24a22ee400a84ad14f"},"downloads":-1,"filename":"PyQSPICE-2024.2.19.tar.gz","has_sig":false,"md5_digest":"845f4a85523767a5c427e4f37ebfef6b","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":22750,"upload_time":"2024-02-19T17:46:29","upload_time_iso_8601":"2024-02-19T17:46:29.269163Z","url":"https://files.pythonhosted.org/packages/51/25/86225f53a4a85d09b326995361d7fff6a2bc7956aeb3503825fe74701f68/PyQSPICE-2024.2.19.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"2024.3.18":{"info":{"author":"Masashi Nogawa","author_email":"","bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":"","downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"","keywords":"QSPICE,Qorvo,SPICE,LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":"","maintainer_email":"","name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2024.3.18/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2024.3.18","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"509ba1601f13d13b2a36d4863f732d6e1c93ba1d440188efa5d6c4d32ddc054e","md5":"26a55960301acc3e84a57e03c05574bd","sha256":"f83b7c0371c61795eba8c1040b6cdc57f83025e55007f10ce83afe04e94d8334"},"downloads":-1,"filename":"PyQSPICE-2024.3.18-py3-none-any.whl","has_sig":false,"md5_digest":"26a55960301acc3e84a57e03c05574bd","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":21790,"upload_time":"2024-03-18T14:29:36","upload_time_iso_8601":"2024-03-18T14:29:36.194796Z","url":"https://files.pythonhosted.org/packages/50/9b/a1601f13d13b2a36d4863f732d6e1c93ba1d440188efa5d6c4d32ddc054e/PyQSPICE-2024.3.18-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"502316fe3a82bdfbded45144c913150c4901caf075d2176c9409826b53cca229","md5":"bf70029107e87ce0528e57eda1b767e7","sha256":"2784caf76f69d4ebd8cb5d523fbbae475f486d817c7021acd01b099552ec3ef2"},"downloads":-1,"filename":"PyQSPICE-2024.3.18.tar.gz","has_sig":false,"md5_digest":"bf70029107e87ce0528e57eda1b767e7","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":23433,"upload_time":"2024-03-18T14:29:37","upload_time_iso_8601":"2024-03-18T14:29:37.634366Z","url":"https://files.pythonhosted.org/packages/50/23/16fe3a82bdfbded45144c913150c4901caf075d2176c9409826b53cca229/PyQSPICE-2024.3.18.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"2024.4.11":{"info":{"author":"Masashi Nogawa","author_email":null,"bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":"QSPICE, Qorvo, SPICE, LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":null,"maintainer_email":null,"name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2024.4.11/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2024.4.11","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"a1ab90eab685be8748d5f941f566075e58350cb43aa71c81e049432a0acfa4a6","md5":"4d219d34cac9b2513c931072d43b9686","sha256":"614b75b705dbdc678091d402c488d92577ae8bade35edd834d0f7d4d8b69fa11"},"downloads":-1,"filename":"PyQSPICE-2024.4.11-py3-none-any.whl","has_sig":false,"md5_digest":"4d219d34cac9b2513c931072d43b9686","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":21803,"upload_time":"2024-04-11T11:54:28","upload_time_iso_8601":"2024-04-11T11:54:28.395319Z","url":"https://files.pythonhosted.org/packages/a1/ab/90eab685be8748d5f941f566075e58350cb43aa71c81e049432a0acfa4a6/PyQSPICE-2024.4.11-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"42a9df3effeac4e60b38ef439cdf5981c4dbe8e7464f544a4af25defdbe15abd","md5":"1d80a4cc362ba2eaaa469fb10d9ec85c","sha256":"e9ecd714e5fdd1afa700d21920f4ba846c9b86ac8f8f527f32da08d885aad106"},"downloads":-1,"filename":"PyQSPICE-2024.4.11.tar.gz","has_sig":false,"md5_digest":"1d80a4cc362ba2eaaa469fb10d9ec85c","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":23459,"upload_time":"2024-04-11T11:54:29","upload_time_iso_8601":"2024-04-11T11:54:29.564006Z","url":"https://files.pythonhosted.org/packages/42/a9/df3effeac4e60b38ef439cdf5981c4dbe8e7464f544a4af25defdbe15abd/PyQSPICE-2024.4.11.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"2024.5.14":{"info":{"author":"Masashi Nogawa","author_email":null,"bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Programming Language :: Python :: 3"],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":"QSPICE, Qorvo, SPICE, LTSpice","license":"Qorvo \"PyQSPICE\" Software License Agreement  This legally binding agreement, for the use of the licensed software installed upon acceptance of this License Agreement, is by and between Qorvo US, Inc, on behalf of itself and its Affiliates and subsidiaries (\"Qorvo\"), and either an individual or legal entity, including each Affiliate of such, as applicable, on whose behalf you are legally authorized to accept this License Agreement (\"Licensee\"). As used herein, \"you,\" \"your,\" or \"Licensee\" shall mean such individual or entity, including Affiliates of such entity.  Licensor is only willing to license the Licensed Software to you on condition that you accept all of the terms in this License Agreement.  By installing or otherwise using or copying the Licensed Software, you expressly agree to be bound by all of the terms of this License Agreement. If you do not agree to the terms of this License Agreement, you may not install, use, compile, or copy the Licensed Software, and you must delete any downloads or copies of the Licensed Software.   1. DEFINITIONS  \"Affiliate\" of a party means any other Person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with the party. For purposes of this definition, the term \"control\" means the power (or, as applicable, the possession or exercise of the power) to direct, or cause the direction of, the management, governance, or policies of a given entity, directly or indirectly, through any applicable means (whether through the legal, beneficial, or equitable ownership, of more than fifty percent (50%) of the aggregate of all voting or equity interests or securities of such entity, through partnership, or through some other form of ownership interest, by contract, or other applicable legal document, or otherwise).  \"Confidential Information\" means all information (whether written, electronic, visual, or oral) disclosed by Licensor that is marked or identified as \"confidential\" or with a similar legend or designation, or that the Licensor otherwise considers in good faith to be confidential.  \"Documentation\" means all documents, in any form, associated with the Licensed Software, including, but not limited to, user manuals, instruction manuals, specifications, and other software-associated documentation.  \"Intellectual Property Rights\" means any and all registered and unregistered rights granted, applied for, or otherwise now or hereafter in existence under or related to any patent, copyright, trademark, trade secret, database protection, or other intellectual property rights Laws, and all similar or equivalent rights or forms of protection, in any part of the world.  \"Licensed Software\" means the Qorvo \"PyQSPICE\" Software of Licensor as provided to Licensee under this Agreement. Licensed Software also includes any additions, updates, and releases thereto issued by Licensor from time-to-time. Licensed Software may be provided in Object Code or Source Code form.  \"Licensee Product\" means a product developed by Licensee embodying Licensee Software.  \"Licensee Software\" means software developed by Licensee using the Licensed Software.  \"Object Code\" means the binary or machine-readable form of the Licensed Software to which it relates.  \"Source Code\" means the human readable source code of the Software to which it relates, in the programming language in which the Software was written, together with any and all related compile or command files, build scripts, or other scripts relating to the creation of the Object Code of the Software.   2. LICENSE  2.1. Use of Licensed Software. Licensor hereby grants to Licensee a worldwide, fully paid-up, non-exclusive, non-transferable license to use the Licensed Software to develop Licensee Software and to incorporate the Licensee Software into Licensee Products.  2.2. No Sale. The licenses granted under this License Agreement do not constitute a sale of the Licensed Software or any portion or copy of it.  2.3. Ownership. Licensee acknowledges Licensor owns and shall retain all right, title, and interest in and to: 2.3.1. the Licensed Software and updates, and Documentation, including all Intellectual Property Rights embodied therein; 2.3.2. all of the service marks, trademarks, trade names or any other designations associated with the Licensed Software; and 2.3.3. all copyrights, patent rights, trade secret rights, and other proprietary rights relating to the Licensed Software, the Documentation, or Licensor's Confidential Information. Licensee further acknowledges and agrees that it shall have no rights with respect to any of the foregoing other than the rights expressly set forth in this License Agreement.  2.4. Restrictions on Use. Licensee agrees not to remove any Licensor identification or notices of any proprietary, patent or copyright restrictions from the Licensed Software, Documentation, or any support material.   3. REPRESENTATIONS AND WARRANTIES  3.1. Mutual Representations and Warranties. Each party represents and warrants to the other party that: (a) it is duly organized, validly existing, and in good standing as a corporation or other entity under the Laws of the jurisdiction of its incorporation or other organization; (b) it has the full right, power, and authority to enter into, and to perform its obligations and grant the rights and licenses it grants or is required to grant under, this Agreement; (c) the execution of this Agreement by its Representative whose signature is set forth at the end of this Agreement has been duly authorized by all necessary corporate or organizational action of such party; and (d) when executed and delivered by both parties, this Agreement will constitute the legal, valid, and binding obligation of such party, enforceable against such party in accordance with its terms.  3.2. DISCLAIMER OF WARRANTIES. ALL QORVO MATERIALS, AND ANY OTHER INFORMATION OR MATERIALS PROVIDED BY QORVO ARE PROVIDED \"AS IS\" AND QORVO HEREBY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHER, AND QORVO SPECIFICALLY DISCLAIMS ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND ALL WARRANTIES ARISING FROM COURSE OF DEALING, USAGE, OR TRADE PRACTICE. WITHOUT LIMITING THE FOREGOING, QORVO MAKES NO WARRANTY OF ANY KIND THAT THE SOFTWARE OR OTHER QORVO MATERIALS, OR ANY PRODUCTS OR RESULTS OF THE USE THEREOF, WILL MEET LICENSEE'S OR ANY OTHER PERSONS' REQUIREMENTS, OPERATE WITHOUT INTERRUPTION, ACHIEVE ANY INTENDED RESULT, BE COMPATIBLE OR WORK WITH ANY OTHER SOFTWARE, HARDWARE, OR OTHER SYSTEMS, OR BE SECURE, ACCURATE, COMPLETE, FREE OF HARMFUL CODE, OR ERROR FREE. ALL THIRD-PARTY MATERIALS ARE PROVIDED \"AS IS\" AND ANY REPRESENTATION OR WARRANTY OF OR CONCERNING ANY THIRD-PARTY MATERIALS IS STRICTLY BETWEEN LICENSEE AND THE THIRD-PARTY OWNER OR DISTRIBUTOR OF THE THIRD-PARTY MATERIALS.  4. LIMITATONS OF LIABILITY  NOTWITHSTANDING ANYTHING ELSE IN THIS AGREEMENT OR OTHERWISE, AND TO THE EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR WILL IN NO EVENT BE LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS AGREEMENT UNDER ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY FOR: (I) ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND WHETHER OR NOT ADVISED IN ADVANCE OF THE POSSIBILITY OF SUCH DAMAGES; (II) DAMAGES FOR LOST PROFITS OR LOST DATA; OR (III) COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES.   5. INDEMNIFICATION  You agree to fully defend and indemnify Licensor and its employees, subcontractors, licensors, and agents from any and all claims, liabilities, and costs (including reasonable attorney's fees) related to: (i) Your use (including Your sublicensee's use, if permitted) of the Licensed Software; or you're your violation of the terms and conditions of this Agreement.  6. CONFIDENTIALITY  6.1. Protection of Confidential Information.  Licensee will protect Licensor's Confidential Information from unauthorized dissemination and use the same degree of care that Licensee uses to protect its own like information, but in no event less than a reasonable degree of care. Licensee will not disclose to third parties Licensor's Confidential Information without the prior written consent of Licensor. Licensee will not use Licensor's Confidential Information for purposes other than those necessary to use the Licensed Software. Notwithstanding the foregoing, Licensee may use or disclose Confidential Information to the extent Licensee is legally required to disclose such Confidential Information provided, however, that prior to any such required disclosure, the Licensee will notify Licensor and will cooperate fully with Licensor in protecting against any such disclosure and/or obtaining a protective order narrowing the scope of such disclosure and/or use of the Confidential Information. Licensee agrees that any breach of this Section would cause irreparable harm to Licensor for which monetary damages would not be adequate and therefore, in the event of a breach of this Section, Licensor shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  6.2. Security. Licensee shall implement reasonable security measures to prevent unauthorized use or disclosure of Licensed Software.  6.3. Notification of Employees. Licensee will take appropriate action by instruction, agreement, or otherwise with its employees, agents, and contractors allowed access to the Confidential Information to satisfy its obligations under this Section 6.   7. TRADEMARKS, COPYRIGHTS, AND NOTICES  7.1. Trademarks.  Licensee is not granted any ownership in or license to the trademarks, marks, service marks or trade names, or good will associated with such marks or names (collectively, \"Marks\") of the Licensor. Licensee shall not use the Marks or confusingly similar marks in connection with any goods or services other than the Licensed Software or in a manner that dilutes, disparages, or harms the reputation of the Licensor.  Licensee agrees that any goodwill arising from its use of the Marks shall inure to the benefit of the Licensor who will be the sole and exclusive owner of such goodwill.  7.2. Use of Marks.  All advertising and other materials in which Licensor's Marks are used shall be subject to the prior written approval of Licensor.  Whenever a Licensee uses the Mark of the Licensor, Licensor shall indicate that such Mark is the property of the Licensor.  7.3. Defense of Trademarks. Licensee will not at any time contest, or assist others in contesting, the validity or enforceability of the Marks of Licensor or do, cause to be done, or tolerate any act or thing contesting or in any way impairing or tending to impair any said right, title, an interest of Licensor in such Marks.  7.4. Copyright Notice. Licensee shall include Licensor's copyright notice as required herein. The following copyright notice is required in Licensee Software: Copyright (c) 2023, Qorvo Inc.  7.5. Third-Party Notices. This license does not apply to any open source software contained in Licensed Software. Rather, the terms and conditions in the applicable open source software license shall apply to the open source software. Nothing in this Agreement limits your rights under, or grants you rights that supersede, any open source software license. You acknowledge that the open source software license is solely between you and the applicable licensor of the open source software. You shall comply with the terms of all applicable open source software licenses, if any. License and copyright information for the open source software are disclosed in the Licensed Software documentation. Licensed Software may include open source software licensed under the General Public License and/or the Lesser General Public License (or any other license requiring us to make a written offer to provide corresponding source code to you). You may obtain the corresponding source code for any such open source software from us for a period of three years after our last shipment of Licensed Software and without charge except for the cost of media, shipping, and handling, upon written request to Licensor. This offer is valid to anyone in receipt of Licensed Software. You may send your request in writing to the address below. Please make sure your request includes the version and name associated with the Licensed Software.  Qorvo US, Inc. Customer Support - Power Management 7628 Thorndike Rd. Greensboro, NC 27409  8. GOVERNING LAW; JURISDICTION; INJUNCTIVE RELIEF; ASSIGNMENT.  8.1. Governing Law and Jurisdiction. This Agreement is governed by and construed in accordance with the internal Laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule that would require or permit the application of the laws of any jurisdiction other than those of the State of Delaware. Any legal Action arising out of or related to this Agreement or the licenses granted hereunder will be instituted exclusively in the federal courts of the United States or the courts of the State of Delaware in each case located in Wilmington and New Castle County, and each party irrevocably submits to the exclusive jurisdiction of such courts in any such Action. Service of process, summons, notice, or other document by mail to such party's address set forth herein will be effective service of process for any Action brought in any such court.  8.2. Injunctive Relief.  A breach of this Agreement adversely affecting Licensor's Intellectual Property Rights in the Licensed Software, Licensor's Products or Documentation may cause irreparable injury to Licensor for which monetary damages may not be an adequate remedy and Licensor. shall be entitled to equitable relief in addition to any remedies it may have hereunder or at law.  8.3. No Third-Party Beneficiaries. This Agreement is for the sole benefit of the parties hereto and their respective permitted successors and permitted assigns and nothing herein, express or implied, is intended to or shall confer upon any other Person any legal or equitable right, benefit, or remedy of any nature whatsoever, under or by reason of this Agreement.  8.4. Amendment and Modification; Waiver. No amendment to or modification of or rescission, termination, or discharge of this Agreement is effective unless it is in writing, identified as an amendment to or rescission, termination, or discharge of this Agreement and signed by an authorized Representative of each party. No waiver by any party of any of the provisions hereof is effective unless explicitly set forth in writing and signed by the party so waiving. Except as otherwise set forth in this Agreement, no failure to exercise, or delay in exercising, any rights, remedy, power, or privilege arising from this Agreement will operate or be construed as a waiver thereof; nor will any single or partial exercise of any right, remedy, power, or privilege hereunder preclude any other or further exercise thereof or the exercise of any other right, remedy, power, or privilege.  8.5. Entire Agreement. This Agreement constitutes the entire agreement between Licensee and Licensor regarding the subject matter of this Agreement, and supersedes all prior communications, negotiations, understandings, agreements or representations, either written or oral, if any. This Agreement may only be amended in a signed writing, duly executed by Licensee and Licensor.  8.6. Assignment. Licensee shall not assign or otherwise transfer any of its rights, or delegate or otherwise transfer any of its obligations or performance, under this Agreement, in each case whether voluntarily, involuntarily, by operation of law, or otherwise, without Qorvo's prior written consent. For purposes of the preceding sentence, and without limiting its generality, any merger, consolidation, or reorganization involving Licensee (regardless of whether Licensee is a surviving or disappearing entity) will be deemed to be a transfer of rights, obligations, or performance under this Agreement for which Qorvo's prior written consent is required. No delegation or other transfer will relieve Licensee of any of its obligations or performance under this Agreement. Any purported assignment, delegation, or transfer in violation of this Section 8.6 is void. This Agreement is binding upon and inures to the benefit of the parties hereto and their respective permitted successors and assigns. ","maintainer":null,"maintainer_email":null,"name":"PyQSPICE","package_url":"https://pypi.org/project/PyQSPICE/","platform":null,"project_url":"https://pypi.org/project/PyQSPICE/","project_urls":{"Homepage":"https://github.com/Qorvo/PyQSPICE","License":"https://github.com/Qorvo/PyQSPICE/LICENSE","QSPICE":"https://www.qorvo.com/design-hub/design-tools/interactive/qspice"},"provides_extra":null,"release_url":"https://pypi.org/project/PyQSPICE/2024.5.14/","requires_dist":["pandas","matplotlib"],"requires_python":">=3.8","summary":"Python Wrapper for QSPICE","version":"2024.5.14","yanked":false,"yanked_reason":null},"last_serial":23734108,"urls":[{"comment_text":"","digests":{"blake2b_256":"c8d6143c326d39fa87bc30a80edf1017a02f6ebea727473f6618f745e9bcd29a","md5":"7a71d69abc2cf4658b0f6eb1bb04b069","sha256":"1b93bc8f4a447e5969e35965d509198399eb3df2b0829aad63dce328c5abbdbc"},"downloads":-1,"filename":"PyQSPICE-2024.5.14-py3-none-any.whl","has_sig":false,"md5_digest":"7a71d69abc2cf4658b0f6eb1bb04b069","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":21980,"upload_time":"2024-06-18T18:41:41","upload_time_iso_8601":"2024-06-18T18:41:41.901082Z","url":"https://files.pythonhosted.org/packages/c8/d6/143c326d39fa87bc30a80edf1017a02f6ebea727473f6618f745e9bcd29a/PyQSPICE-2024.5.14-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"0a5a358c1005080532f2751c18936f7fe75fabf6a8787180819bf8d1f2c34a7c","md5":"82cd64a3e488aac07074ed2f5ed63a96","sha256":"bbee00f2808171435a30b1222485a50e0b13395930a7b62678b192f91ae4bc4f"},"downloads":-1,"filename":"PyQSPICE-2024.5.14.tar.gz","has_sig":false,"md5_digest":"82cd64a3e488aac07074ed2f5ed63a96","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":23626,"upload_time":"2024-06-18T18:41:51","upload_time_iso_8601":"2024-06-18T18:41:51.981357Z","url":"https://files.pythonhosted.org/packages/0a/5a/358c1005080532f2751c18936f7fe75fabf6a8787180819bf8d1f2c34a7c/PyQSPICE-2024.5.14.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]}}