{"0.2.0":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@buckeyemail.osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.0/","requires_dist":["backoff","playwright","toml","openai==0.27.8","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.0","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"11783df56efa36e2755a4a5e1699b57b02575ed23042ff6557534c92b7f1c9ae","md5":"443acf03d662595ed6b9e67b11ee1dfa","sha256":"da725cda3015a67e79117074e0de5e06d70330a4998b1936eb81d14be0babeb8"},"downloads":-1,"filename":"seeact-0.2.0-py3-none-any.whl","has_sig":false,"md5_digest":"443acf03d662595ed6b9e67b11ee1dfa","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":32708,"upload_time":"2024-04-28T15:04:26","upload_time_iso_8601":"2024-04-28T15:04:26.663812Z","url":"https://files.pythonhosted.org/packages/11/78/3df56efa36e2755a4a5e1699b57b02575ed23042ff6557534c92b7f1c9ae/seeact-0.2.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"0a5e754331407da4bfd0b3e79de6b4523c94f46aaaabeaa137cd41636c83d69c","md5":"2ec0aef6bcacc31c30efe44230f64eff","sha256":"ca867b560b305da9098c523fe6dca659ac3c344003494b288eded150861955b7"},"downloads":-1,"filename":"seeact-0.2.0.tar.gz","has_sig":false,"md5_digest":"2ec0aef6bcacc31c30efe44230f64eff","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":28915,"upload_time":"2024-04-28T15:04:28","upload_time_iso_8601":"2024-04-28T15:04:28.292147Z","url":"https://files.pythonhosted.org/packages/0a/5e/754331407da4bfd0b3e79de6b4523c94f46aaaabeaa137cd41636c83d69c/seeact-0.2.0.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.1":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@buckeyemail.osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>, Zheng Du <du.913@buckeyemail.osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.1/","requires_dist":["backoff","playwright","toml","openai==0.27.8","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.1","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"037c74335f4b3f9ec89ceaeb5e1c0ca488b1e221271dbfe340d15634490ee686","md5":"b7dd6d52258a0f13352c1920254ad569","sha256":"7b3409194a1a9affc90bd79dd98eb2d8ae6bef08de1ecfc6293237ab146d6e88"},"downloads":-1,"filename":"seeact-0.2.1-py3-none-any.whl","has_sig":false,"md5_digest":"b7dd6d52258a0f13352c1920254ad569","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":32970,"upload_time":"2024-04-29T00:17:02","upload_time_iso_8601":"2024-04-29T00:17:02.535590Z","url":"https://files.pythonhosted.org/packages/03/7c/74335f4b3f9ec89ceaeb5e1c0ca488b1e221271dbfe340d15634490ee686/seeact-0.2.1-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"a7aebab92ecd77073718e4d42e1174d8977bae7701b647e24c8270067366cbef","md5":"17ffb6603acab0cd737a21645d64c1d0","sha256":"f25093781d70d607ac2ae65ae41a0dfcd81b2241ca148895852e99cbfc05c3d7"},"downloads":-1,"filename":"seeact-0.2.1.tar.gz","has_sig":false,"md5_digest":"17ffb6603acab0cd737a21645d64c1d0","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":29164,"upload_time":"2024-04-29T00:17:04","upload_time_iso_8601":"2024-04-29T00:17:04.443986Z","url":"https://files.pythonhosted.org/packages/a7/ae/bab92ecd77073718e4d42e1174d8977bae7701b647e24c8270067366cbef/seeact-0.2.1.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.2":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@buckeyemail.osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>, Zheng Du <du.913@buckeyemail.osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.2/","requires_dist":["backoff","playwright","toml","openai==0.27.8","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.2","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"805c87275ae2010c1f374f3cbba22bc78151dd70596617050b4792fe1a859464","md5":"4c120dcaeca0637764f86d29ed49a3ae","sha256":"65ea8f074b2b085028a8f8a6e0b8297bf3fdf48154670e139538a51242ffbc9d"},"downloads":-1,"filename":"seeact-0.2.2-py3-none-any.whl","has_sig":false,"md5_digest":"4c120dcaeca0637764f86d29ed49a3ae","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":33057,"upload_time":"2024-04-29T00:46:25","upload_time_iso_8601":"2024-04-29T00:46:25.999795Z","url":"https://files.pythonhosted.org/packages/80/5c/87275ae2010c1f374f3cbba22bc78151dd70596617050b4792fe1a859464/seeact-0.2.2-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"df0f0852d5c10d3191122fbb879fe8a5a78d37551d0d0790f44607f26d994edf","md5":"0f5b2f481f1aca7fe3a49d052bb351de","sha256":"a5d732f45b4bf1fae6390199ea1ede4122fa09c893e091bcf09aa7bec905113e"},"downloads":-1,"filename":"seeact-0.2.2.tar.gz","has_sig":false,"md5_digest":"0f5b2f481f1aca7fe3a49d052bb351de","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":29239,"upload_time":"2024-04-29T00:46:27","upload_time_iso_8601":"2024-04-29T00:46:27.730455Z","url":"https://files.pythonhosted.org/packages/df/0f/0852d5c10d3191122fbb879fe8a5a78d37551d0d0790f44607f26d994edf/seeact-0.2.2.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.3":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@buckeyemail.osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>, Zheng Du <du.913@buckeyemail.osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.3/","requires_dist":["backoff","playwright","toml","openai==0.27.8","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.3","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"a45b37ed18e5495e3dccd055deb1f7d3f1e295e5d201e690fc4699072b436514","md5":"8a7202dcc847bb7430c735e966b6360f","sha256":"99bb78d83ac32d1818606bec79b0f28e19cc629210cec80010c49f6a5c2308ab"},"downloads":-1,"filename":"seeact-0.2.3-py3-none-any.whl","has_sig":false,"md5_digest":"8a7202dcc847bb7430c735e966b6360f","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":33069,"upload_time":"2024-04-29T00:52:23","upload_time_iso_8601":"2024-04-29T00:52:23.174721Z","url":"https://files.pythonhosted.org/packages/a4/5b/37ed18e5495e3dccd055deb1f7d3f1e295e5d201e690fc4699072b436514/seeact-0.2.3-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"1a2692fd4ae255e5dd22d758313a457865dc28523f133df3e64c2fe934718260","md5":"31d8b972d44d09ea76e82fd1278cbf84","sha256":"1c2a059cbbc41aee61c3cf700ebc805745df1bb39eb2adb8f3ce64b7c6631ee6"},"downloads":-1,"filename":"seeact-0.2.3.tar.gz","has_sig":false,"md5_digest":"31d8b972d44d09ea76e82fd1278cbf84","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":29241,"upload_time":"2024-04-29T00:52:24","upload_time_iso_8601":"2024-04-29T00:52:24.348243Z","url":"https://files.pythonhosted.org/packages/1a/26/92fd4ae255e5dd22d758313a457865dc28523f133df3e64c2fe934718260/seeact-0.2.3.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.4":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@buckeyemail.osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>, Zheng Du <du.913@buckeyemail.osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.4/","requires_dist":["backoff","playwright","toml","openai==0.27.8","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.4","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"32f5539e946c8b4a12e518e47a96f94d6a383ad03f2e09bf9480589eb03599be","md5":"52849d5f8afdb2a5df9f9ecfe75fe15a","sha256":"b0e342355519f0444d96dd882760d4cda86f1f6a672db14cad796524640e41c6"},"downloads":-1,"filename":"seeact-0.2.4-py3-none-any.whl","has_sig":false,"md5_digest":"52849d5f8afdb2a5df9f9ecfe75fe15a","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":33074,"upload_time":"2024-04-29T22:17:24","upload_time_iso_8601":"2024-04-29T22:17:24.715413Z","url":"https://files.pythonhosted.org/packages/32/f5/539e946c8b4a12e518e47a96f94d6a383ad03f2e09bf9480589eb03599be/seeact-0.2.4-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"e5cd5d139b73f2da15901b7a43d0248f4b7539f22bc21b398033d462fc8b8cf2","md5":"ba07cba003ae2bbb01b06b07206e88ac","sha256":"f446daa57b9a2227e2a2bbc7ab7cb3c385e090137890d3c6f8ee2e6e14afa697"},"downloads":-1,"filename":"seeact-0.2.4.tar.gz","has_sig":false,"md5_digest":"ba07cba003ae2bbb01b06b07206e88ac","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":29283,"upload_time":"2024-04-29T22:17:26","upload_time_iso_8601":"2024-04-29T22:17:26.443863Z","url":"https://files.pythonhosted.org/packages/e5/cd/5d139b73f2da15901b7a43d0248f4b7539f22bc21b398033d462fc8b8cf2/seeact-0.2.4.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.5":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@buckeyemail.osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>, Zheng Du <du.913@buckeyemail.osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.5/","requires_dist":["backoff","playwright","toml","openai==0.27.8","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.5","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"1cda246547c8cb3db96d47a8f6c4e128e7a4ff2bc13fb4dd195b38504f4faae3","md5":"a11f3273aa8e385d03b93666a97c446d","sha256":"c78d925053fdb3f3dc8951947f5f4caff0563da4211a7ddefb0c35fe02dc3529"},"downloads":-1,"filename":"seeact-0.2.5-py3-none-any.whl","has_sig":false,"md5_digest":"a11f3273aa8e385d03b93666a97c446d","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":33066,"upload_time":"2024-04-29T22:22:46","upload_time_iso_8601":"2024-04-29T22:22:46.508690Z","url":"https://files.pythonhosted.org/packages/1c/da/246547c8cb3db96d47a8f6c4e128e7a4ff2bc13fb4dd195b38504f4faae3/seeact-0.2.5-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"d6b206280490f89dc44983865a16a8cd3f527a6bd5f03ca7950727f61fa6d3c6","md5":"a975d977d13e8fed1b6483e29f5e1e2f","sha256":"8c46bbe3e70f44e61427d28d1340bcd0a23faea4c28808eec1f569b602968601"},"downloads":-1,"filename":"seeact-0.2.5.tar.gz","has_sig":false,"md5_digest":"a975d977d13e8fed1b6483e29f5e1e2f","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":29286,"upload_time":"2024-04-29T22:22:47","upload_time_iso_8601":"2024-04-29T22:22:47.602613Z","url":"https://files.pythonhosted.org/packages/d6/b2/06280490f89dc44983865a16a8cd3f527a6bd5f03ca7950727f61fa6d3c6/seeact-0.2.5.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.5.1":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@buckeyemail.osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>, Zheng Du <du.913@buckeyemail.osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.5.1/","requires_dist":["backoff","playwright","toml","openai==0.27.8","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.5.1","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"d7ec748c4131e9e99e094edb654f3489db2c442d9bbdabd451e22b5808c732cc","md5":"c616ccdf6ae1292a26054a666dac6c1d","sha256":"dc37623a3daff56f48e3b13e8fffdf66df9893836e36d57a59c40fabd464c093"},"downloads":-1,"filename":"seeact-0.2.5.1-py3-none-any.whl","has_sig":false,"md5_digest":"c616ccdf6ae1292a26054a666dac6c1d","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":33088,"upload_time":"2024-05-01T01:21:01","upload_time_iso_8601":"2024-05-01T01:21:01.000023Z","url":"https://files.pythonhosted.org/packages/d7/ec/748c4131e9e99e094edb654f3489db2c442d9bbdabd451e22b5808c732cc/seeact-0.2.5.1-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"103bb197944fc514bd347de4c62a778b82f1220558ed7ebd85f5d59435c9d92f","md5":"ca8877eedb003c7846005ff50477639e","sha256":"25a63f8c496a9e4606de9f99633fc14e4130eee73cf92fa67e44b7f0ed8d2770"},"downloads":-1,"filename":"seeact-0.2.5.1.tar.gz","has_sig":false,"md5_digest":"ca8877eedb003c7846005ff50477639e","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":29281,"upload_time":"2024-05-01T01:21:04","upload_time_iso_8601":"2024-05-01T01:21:04.873252Z","url":"https://files.pythonhosted.org/packages/10/3b/b197944fc514bd347de4c62a778b82f1220558ed7ebd85f5d59435c9d92f/seeact-0.2.5.1.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.6":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>, Zheng Du <du.913@osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.6/","requires_dist":["backoff","playwright","toml","openai==1.24.0","litellm==1.35.32","google-generativeai==0.5.2","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.6","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"396e5fcffc997f8cb0157c2c8b7a7863dda9da98ea34dc8d183681eb43af8c0b","md5":"3c4b4c4a8929b6d2e598f1460f16a818","sha256":"42624a87a586bb5401d101112c84516893302476288161552dc8c49d0e102e44"},"downloads":-1,"filename":"seeact-0.2.6-py3-none-any.whl","has_sig":false,"md5_digest":"3c4b4c4a8929b6d2e598f1460f16a818","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":33714,"upload_time":"2024-05-18T19:38:52","upload_time_iso_8601":"2024-05-18T19:38:52.891703Z","url":"https://files.pythonhosted.org/packages/39/6e/5fcffc997f8cb0157c2c8b7a7863dda9da98ea34dc8d183681eb43af8c0b/seeact-0.2.6-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"b3ffd343392a950de53bf3e9172c9e5e98d89a9e8e71e0a0070b96e0f433e712","md5":"a9b6e6438d7a640c13efdae07d0ce86f","sha256":"eca4495e22f628f40c7bf7a0812f91272bdf078c2ce776b8b1292001748a4ca2"},"downloads":-1,"filename":"seeact-0.2.6.tar.gz","has_sig":false,"md5_digest":"a9b6e6438d7a640c13efdae07d0ce86f","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":29931,"upload_time":"2024-05-18T19:38:54","upload_time_iso_8601":"2024-05-18T19:38:54.469619Z","url":"https://files.pythonhosted.org/packages/b3/ff/d343392a950de53bf3e9172c9e5e98d89a9e8e71e0a0070b96e0f433e712/seeact-0.2.6.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.6.1":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>, Zheng Du <du.913@osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.6.1/","requires_dist":["backoff","playwright","toml","openai==1.24.0","litellm==1.35.32","google-generativeai==0.5.2","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.6.1","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"cf1009763d86bee4a4b7c8c57f6b7d0b350c9b164ffa0f9d02b6d244f6eb93a5","md5":"f49463b38011b77368793fc300c5a3db","sha256":"31dfef983951fb4f64255e1c16fb337be46c2a53fda6095edc78bbb260ba7c8c"},"downloads":-1,"filename":"seeact-0.2.6.1-py3-none-any.whl","has_sig":false,"md5_digest":"f49463b38011b77368793fc300c5a3db","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":10515,"upload_time":"2024-05-19T02:44:57","upload_time_iso_8601":"2024-05-19T02:44:57.004066Z","url":"https://files.pythonhosted.org/packages/cf/10/09763d86bee4a4b7c8c57f6b7d0b350c9b164ffa0f9d02b6d244f6eb93a5/seeact-0.2.6.1-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"80a7a976ddb47b5c01af2f3a0352ac78dd047b9015a8f5ba822be223d396bec1","md5":"2e9db264c8820da9177526ccefed3723","sha256":"afe49eec0bae7173d95dc605efd47ef4b607258f7a841409b69d47c213e0a21f"},"downloads":-1,"filename":"seeact-0.2.6.1.tar.gz","has_sig":false,"md5_digest":"2e9db264c8820da9177526ccefed3723","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":29946,"upload_time":"2024-05-19T02:44:58","upload_time_iso_8601":"2024-05-19T02:44:58.576560Z","url":"https://files.pythonhosted.org/packages/80/a7/a976ddb47b5c01af2f3a0352ac78dd047b9015a8f5ba822be223d396bec1/seeact-0.2.6.1.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.6.2":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>, Zheng Du <du.913@osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.6.2/","requires_dist":["backoff","playwright","toml","openai==1.24.0","litellm==1.35.32","google-generativeai==0.5.2","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.6.2","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"be976babf25eb6c7c7d69d37072027190f0f746150e06d172cb8a024b2fa4c33","md5":"63437ad9f7079a8971d02262b7fbd944","sha256":"dcb097daf8763a4d1f7b68cb863c75212646749990103dd1909d9a59ec70a401"},"downloads":-1,"filename":"seeact-0.2.6.2-py3-none-any.whl","has_sig":false,"md5_digest":"63437ad9f7079a8971d02262b7fbd944","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":33744,"upload_time":"2024-05-19T02:52:55","upload_time_iso_8601":"2024-05-19T02:52:55.092167Z","url":"https://files.pythonhosted.org/packages/be/97/6babf25eb6c7c7d69d37072027190f0f746150e06d172cb8a024b2fa4c33/seeact-0.2.6.2-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"3b2d7a25fbbad7b2c3a991c7c1e7f5534b7a45d2cce1e5a876c4f5198b953716","md5":"f7140f3eb83ba1b25167a027e505feb9","sha256":"47cf8dfe69d020454a12a19cdf5b87b2147f50afb8b9025e836ed8184983da9e"},"downloads":-1,"filename":"seeact-0.2.6.2.tar.gz","has_sig":false,"md5_digest":"f7140f3eb83ba1b25167a027e505feb9","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":29955,"upload_time":"2024-05-19T02:52:56","upload_time_iso_8601":"2024-05-19T02:52:56.651642Z","url":"https://files.pythonhosted.org/packages/3b/2d/7a25fbbad7b2c3a991c7c1e7f5534b7a45d2cce1e5a876c4f5198b953716/seeact-0.2.6.2.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.7.0":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>, Zheng Du <du.913@osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.7.0/","requires_dist":["backoff","playwright","toml","openai==1.24.0","litellm==1.35.32","google-generativeai==0.5.2","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.7.0","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"db04e266e5585f7ac924186e8e6c95a75f78ac3638a802c19940a290b6bc7948","md5":"db9c6da0b4e6b2006b7829b119ec8210","sha256":"9ebf896a10e221731aaa9098ff51974999ffccc8e6b8c2a58afb754f9951c185"},"downloads":-1,"filename":"seeact-0.2.7.0-py3-none-any.whl","has_sig":false,"md5_digest":"db9c6da0b4e6b2006b7829b119ec8210","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":34147,"upload_time":"2024-07-10T03:21:06","upload_time_iso_8601":"2024-07-10T03:21:06.457294Z","url":"https://files.pythonhosted.org/packages/db/04/e266e5585f7ac924186e8e6c95a75f78ac3638a802c19940a290b6bc7948/seeact-0.2.7.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"fb2ffcca8abb47c7e1daf53b1ffd7c4bbd0f0bf200ccdc5f9665b5b46f9a67f0","md5":"a1788316ad873245cf98ed65edfbcf96","sha256":"1a7b447a123353fdc33cfb4431332fa37dd2391cf36ca27df690c89991a50564"},"downloads":-1,"filename":"seeact-0.2.7.0.tar.gz","has_sig":false,"md5_digest":"a1788316ad873245cf98ed65edfbcf96","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":30437,"upload_time":"2024-07-10T03:21:08","upload_time_iso_8601":"2024-07-10T03:21:08.367659Z","url":"https://files.pythonhosted.org/packages/fb/2f/fcca8abb47c7e1daf53b1ffd7c4bbd0f0bf200ccdc5f9665b5b46f9a67f0/seeact-0.2.7.0.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"0.2.8.0":{"info":{"author":null,"author_email":"Boyu Gou <gou.43@osu.edu>, Boyuan Zheng <zheng.2372@osu.edu>, Zheng Du <du.913@osu.edu>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"AI PUBS OPEN RAIL-S LICENSE Version 0.1, March 2, 2023  http://licenses.ai/  Copyright (c) 2024 OSU Natural Language Processing Group  Section  I:  PREAMBLE  This OpenRAIL-S License is generally applicable to any Source Code to be licensed with responsible use restrictions.  The “Open” nomenclature indicates that the licensed Source Code is freely accessible to downstream and other users. The “RAIL” nomenclature indicates that there are use restrictions prohibiting the use of the Source Code. These restrictions are intended to avoid potential misuse of such Source Code. Even though derivative versions of the Source Code could be released under different licensing terms, the License specifies that the use restrictions in the original License must apply to such derivatives.  NOW THEREFORE, You and Licensor agree as follows:  1. Definitions  (a) \"Contribution\" means any software code, including modifications or additions to the Source Code, that is intentionally submitted to Licensor for inclusion in the Source Code base by the rights owner or by an individual or legal entity authorized to submit on behalf of the rights owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Source Code, but excluding communication that is conspicuously marked or otherwise designated in writing by the rights owner as \"Not a Contribution.\"  (b) \"Contributor\" means Licensor and any individual or legal entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Source Code.  (c) “Data” means a collection of information and/or content extracted from the dataset used with the Model, including to train, pretrain, or otherwise evaluate the Model. The Data is not licensed under this License.  (d) “Derivatives” means all works containing additions and/or modifications to the Source Code.  (e) “Harm” includes but is not limited to physical, mental, psychological, financial and reputational damage, pain, or loss.  (f) \"License\" means the terms and conditions for use, reproduction, and distribution as defined in this document.  (g) “Licensor” means the rights owner or entity authorized by the rights owner that is granting the License, including the persons or entities that may have rights in the Source Code.  (h) “Model” means any machine-learning based assemblies (including checkpoints), consisting of learnt weights and parameters (including optimizer states), corresponding to all or part of the model architecture as embodied in the Source Code, that have been trained or tuned, in whole or in part on the Data, using the Source Code and other materials.  (i) “Source Code” means any collection of text written using human-readable programming language, including the code and scripts used to define, run, load, benchmark or evaluate a Model or any component thereof, and/or used to prepare data for training or evaluation. For clarity, the term “Source Code” as used in this License includes any and all Derivatives of such Source Code.  (j) “Third Parties” means individuals or legal entities that are not under common control with Licensor or You.  (k) \"You\" (or \"Your\")  means an individual or legal entity exercising permissions granted by this License.  Section II:   INTELLECTUAL PROPERTY RIGHTS  Both copyright and patent grants may apply to the Source Code. The Source Code is subject to additional terms as described in Section III, which shall govern the use of the Source Code even in the event Section II is held unenforceable.  2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare, publicly display, publicly performƒ, sublicense, and distribute the Source Code.  3. Grant of Patent License. Subject to the terms and conditions of this License and where and as applicable, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this paragraph) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Source Code where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Source Code to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Source Code and/or a Contribution incorporated within the Source Code constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for the Source Code shall terminate as of the date such litigation is asserted or filed.  Section III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION  4. Distribution and Redistribution. You may host for Third Party remote access purposes (e.g. software-as-a-service), reproduce and distribute copies of the Source Code thereof in any medium, with or without modifications, provided that You meet the following conditions:  (a) Use-based restrictions in paragraph 5 MUST be included as an enforceable provision by You in any type of legal agreement (e.g. a license) governing the use and/or distribution of the Source Code, and You shall give notice to subsequent users You Distribute to, that the Source Code is subject to paragraph 5.  (b) You must give any Third Party recipients of the Source Code a copy of this License;  (c) You must cause any modified files to carry prominent notices stating that You changed the files;  (d) You must retain all copyright, patent, trademark, and attribution notices excluding those notices that do not pertain to any part of the Source Code.  You may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions - respecting paragraph 4.a. - for use, reproduction, or distribution of Your modifications, or for any Derivatives, provided Your use, reproduction, and distribution of the Source Code otherwise complies with the conditions stated in this License.  5. Use-based restrictions. The restrictions set forth in Attachment A are considered use-based restrictions. Therefore You cannot use the Source Code in violation of such restrictions. You may use the Source Code subject to this License, including only for lawful purposes and in accordance with the License. You shall require all of Your users and licensees who use the Source Code to comply with the terms of this paragraph 5.  Section IV: OTHER PROVISIONS  7. Updates and Runtime Restrictions. To the maximum extent permitted by law, Licensor reserves the right to restrict (remotely or otherwise) usage of the Source Code in violation of this License, or update the Source Code through electronic means..  8. Trademarks and related. Nothing in this License permits You to make use of Licensors’ trademarks, trade names, logos or to otherwise suggest endorsement or misrepresent the relationship between the parties; and any rights not expressly granted herein are reserved by the Licensors.  9. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Source Code (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either EXPRESS or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Source Code, and assume any risks associated with Your exercise of permissions under this License.  10. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Source Code (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.  11. Accepting Warranty or Additional Liability. While redistributing the Source Code, You may choose to charge a fee in exchange for support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.  12. If any provision of this License is held to be invalid, illegal or unenforceable, the remaining provisions shall be unaffected thereby and remain valid as if such provision had not been set forth herein.  END OF TERMS AND CONDITIONS  Attachment A  USE RESTRICTIONS You agree not to use the Source Code or its Derivatives in any of the following ways:  1. Legal:  (a) In any way that violates any applicable national, federal, state, local or international law or regulation.  2. Harm and Discrimination  (a) For the purpose of exploiting, Harming or attempting to exploit or Harm minors in any way;  (b) To generate or disseminate false information with the purpose of Harming others;  (c) To generate or disseminate personal identifiable information that can be used to Harm an individual;  (d) To defame, disparage or otherwise harass others;  (e) For any use intended to or which has the effect of Harming individuals or groups based on online or offline social behavior or known or predicted personal or personality characteristics  (f) To exploit any of the vulnerabilities of a specific group of persons based on their age, social, physical or mental characteristics, in order to materially distort the behavior of a person belonging to that group in a manner that causes or is likely to cause that person or another person Harm  (g) For any use intended to or which has the effect of discriminating against individuals or groups based on legally protected characteristics or categories.  3. Transparency  (a) To generate or disseminate machine-generated information or content in any medium  without expressly and intelligibly disclaiming that it is machine-generated;  (b) To impersonate or attempt to impersonate human beings for purposes of deception;  (c) For fully automated decision making that adversely impacts an individual’s legal rights or otherwise creates or modifies a binding, enforceable obligation.  ","maintainer":null,"maintainer_email":null,"name":"seeact","package_url":"https://pypi.org/project/seeact/","platform":null,"project_url":"https://pypi.org/project/seeact/","project_urls":{"documentation":"https://github.com/OSU-NLP-Group/SeeAct","homepage":"https://osu-nlp-group.github.io/SeeAct/","repository":"https://github.com/OSU-NLP-Group/SeeAct"},"provides_extra":null,"release_url":"https://pypi.org/project/seeact/0.2.8.0/","requires_dist":["backoff","playwright","toml","openai==1.24.0","litellm==1.35.32","google-generativeai==0.5.2","python-dotenv"],"requires_python":">=3.9","summary":"SeeAct is a system for generalist web agents that autonomously carry out tasks on any given website, with a focus on large multimodal models (LMMs) such as GPT-4V(ision). It consists of two main components: (1) A robust codebase that supports running web agents on live websites, and (2) an innovative framework that utilizes LMMs as generalist web agents.","version":"0.2.8.0","yanked":false,"yanked_reason":null},"last_serial":24613569,"urls":[{"comment_text":"","digests":{"blake2b_256":"49422bf85cc5c88261d32517a638b3b5e22b0f1d36c3d82e4fb4f1d63309c751","md5":"b7eed6b57ffa4da70203dc502813e323","sha256":"7279dc064d6f8cd2946984f74691132e927adaf2b9b7d2ca8a7b5ca8f50c33d3"},"downloads":-1,"filename":"seeact-0.2.8.0-py3-none-any.whl","has_sig":false,"md5_digest":"b7eed6b57ffa4da70203dc502813e323","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":35723,"upload_time":"2024-08-17T17:55:49","upload_time_iso_8601":"2024-08-17T17:55:49.273436Z","url":"https://files.pythonhosted.org/packages/49/42/2bf85cc5c88261d32517a638b3b5e22b0f1d36c3d82e4fb4f1d63309c751/seeact-0.2.8.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"46c6e2f5768a1cc9359218ee2a5dbc0a608a4912554bfae506f1ad7e9ee90ccb","md5":"74506ab6614eb56ac472a6c3efa97f47","sha256":"f5e629af53b93e016c24e554638f3ce6e2c925515f88bed4fa8e2e87417c3f9a"},"downloads":-1,"filename":"seeact-0.2.8.0.tar.gz","has_sig":false,"md5_digest":"74506ab6614eb56ac472a6c3efa97f47","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":31574,"upload_time":"2024-08-17T17:55:50","upload_time_iso_8601":"2024-08-17T17:55:50.312596Z","url":"https://files.pythonhosted.org/packages/46/c6/e2f5768a1cc9359218ee2a5dbc0a608a4912554bfae506f1ad7e9ee90ccb/seeact-0.2.8.0.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]}}