{"1.0.0":{"info":{"author":"Stein Aerts Lab","author_email":null,"bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":" Academic Non-commercial Software License Agreement  The Licensed Software is developed by and on behalf of the Laboratory of Computational Biology of VIB-KU Leuven and is owned by VIB vzw, located at Rijvisschestraat 120, B-9052 Zwijnaarde, Belgium (hereinafter referred to as \"VIB\"). By downloading or installing the Licensed Software, the user agrees with the terms and conditions below.  Definitions  “Licensed Software” shall mean CREsted as available on GitHub.  \"Effective Date\" shall mean the date on which you download or install CREsted (as available on GitHub) on your system and which provide you access to the CREsted tool.  “Commercial Purposes” shall include (1) the use of Licensed Software to provide a service, information or data that is directly or indirectly conveyed to any third party against compensation, (2) any type of transfer of the Licensed Software for compensation, and (3) any other use of Licensed Software that supports commercial entities.  License  1.\tLicensed Software is the work of the Aerts lab. The copyright in Licensed Software is owned by VIB.  2.\tSubject to the terms and conditions of this Agreement, VIB hereby grants and the user accepts a non-exclusive, non-transferable license to use the Licensed Software for strictly internal academic research use only, on your own behalf or on behalf of your institution, and not for Commercial Purposes.  3.\tThe user confirms to be an academic user. For academic users, there is no license fee.  4. TODO: reference  5.\tThis license does not entitle the user to receive from VIB hard-copy documentation, technical support, telephone assistance, or enhancements or updates to the Licensed Software, and nothing contained herein shall be interpreted as to require VIB, its faculty, employees or students to provide maintenance, installation services, debugging, consultation or end-user support of any kind.  6.\tThe title and copyright to Licensed Software and any associated programs and documentation shall remain with VIB. The user agrees to preserve the same.  7.\tThe user agrees not to make any copies of Licensed Software except for use in the user’s laboratory, without VIB’s prior written consent.  The user agrees to place the appropriate copyright notice on any such copies.  8.\tThe user shall not distribute Licensed Software to other laboratories within user’s institution. The user shall not transfer Licensed Software to another location or person outside of user’s institution without VIB’s prior and written permission.  9.\tThe user shall not market or otherwise benefit commercially from any product utilizing any portion of Licensed Software, nor any derivative works of Licensed Software, without first entering into a separate commercial license with VIB.  10.\tExcept as otherwise expressly permitted in this Agreement, the user must not (i) modify or create any derivative works of the Licensed Software or documentation, including customization, translation or localization; (ii) decompile, disassemble, reverse engineer, or otherwise attempt to derive the source code for the Licensed Software; (iii) remove or alter any trademark, logo, copyright or other proprietary notices, legends, symbols or labels in the Licensed Software.  11.\tThe user acknowledges that the Licensed Software is proprietary to VIB. The software code shall be treated as trade secrets and confidential information of VIB, and the user agrees to use all reasonable efforts to hold the same in confidence. The user’s obligation for confidentiality shall not extend to any information which (i) is or becomes generally available to the public, (ii) is already known to or subsequently disclosed by third parties to the user and at its free disposal, or (iii) is independently developed by the user or its affiliates without the use of the confidential information disclosed by VIB, or (iv) is required by law or legal process to be disclosed.  12.\tThe user acknowledges that Licensed Software is a research tool and provided free of charge, it is only provided “as is”. VIB makes no representations or warranties of any type whatsoever, express or implied, regarding the Licensed Software. VIB expressly disclaims all representations and warranties regarding the Licensed Software, including but not limited to any representations or warranties of merchantability or fitness for any particular application or that the use of the Licensed Software will not infringe any patents, copyrights or trademarks or other rights of third parties, or any warranty that the rights and licenses granted hereunder comprise all the rights and licenses necessary or desirable to use the Licensed Software for internal non-commercial research purposes as permitted by this Agreement. The entire risk as to the quality and performance of the Licensed Software is borne by the user.  13.\tVIB shall not be responsible for losses of any kind resulting from the use of Licensed Software, and can in no way provide compensation for any losses sustained, including but not limited to, any obligation, liability, right, claim or remedy for tort, or for any actual or alleged infringement of patents, copyrights, trade secrets, or similar rights of third parties, nor any business expense, machine downtime or damages caused by any deficiency, defect or error in Licensed Software or mal-function thereof, nor any incidental or consequential damages, however caused.  14.\tThe user will indemnify, defend and hold harmless VIB, its directors, officers, employees and agents from and against all liability, losses, damages and expenses (including attorney’s fees and costs) arising out of any claims, demands, actions or other proceedings made or instituted by any third party against any of them and arising out of or relating to any breach of this Agreement by the user, or any use of the Licensed Software by the user, except insofar as such claims or liability result from VIB’s gross negligence or willful misconduct.  15.\tThis Agreement and the license rights granted herein shall become effective as of the date the user downloaded the Licensed Software and shall continue in full force until the user deletes the Licensed Software and any and all related files from the user’s computing system, unless terminated in accordance with this Section. Upon one party's breach of any agreement, covenant, or representation made in this Agreement, the agreement will automatically end thirty (30) days after such breach. Either party shall have the right, at any time, to terminate this Agreement without cause by written notice to the other party specifying the date of termination. Upon termination, the user shall destroy all full and partial copies of the Licensed Software. The user shall forward written notice to VIB that all programs containing Licensed Software have been deleted from all computer libraries and storage or memory devices and are no longer stored therein.  16.\tThis Agreement shall be construed in accordance with the laws of Belgium. The courts of Belgium shall have exclusive jurisdiction.  17.\tThe parties agree that this Agreement is the complete and exclusive agreement among the parties and supersedes all proposals and prior agreements whether written or oral, and all other communications among the parties relating to the subject matter of this Agreement. This Agreement cannot be modified except in writing and signed by both parties. Failure by either party at any time to enforce any of the provisions of this Agreement shall not constitute a waiver by such party of such provision nor in any way affect the validity of this Agreement.  18.\tThe invalidity of singular provisions does not affect the validity of the entire understanding. The parties are obligated, however, to replace the invalid provisions by a regulation, which comes closest to the economic intent of the invalid provision. The same shall apply mutatis mutandis in case of a gap.   THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.","maintainer":null,"maintainer_email":"Lukas Mahieu <lukas.mahieu@kuleuven.be>","name":"crested","package_url":"https://pypi.org/project/crested/","platform":null,"project_url":"https://pypi.org/project/crested/","project_urls":{"Documentation":"https://crested.readthedocs.io/","Home-page":"https://github.com/aertslab/crested/","Source":"https://github.com/aertslab/crested/"},"provides_extra":["dev","doc","test","tfmodisco"],"release_url":"https://pypi.org/project/crested/1.0.0/","requires_dist":["anndata","keras>=3.4.0","logomaker","loguru","numpy","pandas","pooch","pybigtools>=0.2.0","pysam","scikit-learn","seaborn","tqdm","wandb>=0.12.10","pre-commit; extra == \"dev\"","pytest; extra == \"dev\"","twine>=4.0.2; extra == \"dev\"","docutils!=0.18.*,!=0.19.*,>=0.8; extra == \"doc\"","ipykernel; extra == \"doc\"","ipython; extra == \"doc\"","myst-nb; extra == \"doc\"","pandas; extra == \"doc\"","sphinx-autodoc-typehints; extra == \"doc\"","sphinx-book-theme>=1.0.0; extra == \"doc\"","sphinx-copybutton; extra == \"doc\"","sphinx>=4; extra == \"doc\"","sphinxcontrib-bibtex>=1.0.0; extra == \"doc\"","sphinxext-opengraph; extra == \"doc\"","anndata; extra == \"test\"","coverage; extra == \"test\"","genomepy; extra == \"test\"","pytest; extra == \"test\"","tensorflow; extra == \"test\"","modisco-lite; extra == \"tfmodisco\""],"requires_python":">=3.9","summary":"CREsted: Cis-Regulatory Element Sequence Training, Explanation, and Design","version":"1.0.0","yanked":false,"yanked_reason":null},"last_serial":25431223,"urls":[{"comment_text":"","digests":{"blake2b_256":"421eb14e77bff2406d06a0ca0e14ce390262459c6db3341f9112cbe0a6f8fb91","md5":"d947396c166be141c195fb8347988422","sha256":"4cf35a7816eeaa7c854d8dfb98c3ab3ea261bd8c398ad071bc9df86451663b7a"},"downloads":-1,"filename":"crested-1.0.0-py3-none-any.whl","has_sig":false,"md5_digest":"d947396c166be141c195fb8347988422","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":97546,"upload_time":"2024-08-14T11:36:58","upload_time_iso_8601":"2024-08-14T11:36:58.228481Z","url":"https://files.pythonhosted.org/packages/42/1e/b14e77bff2406d06a0ca0e14ce390262459c6db3341f9112cbe0a6f8fb91/crested-1.0.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"595967c962c4d2ee8be749b48abac93c308741cf2aeb56b943d352846ab6b745","md5":"e22b7268585b8aeca8dbcf17171a98b4","sha256":"2396fc430f5e3907d8c5f15fba2a7f0ffbc14dd550fca22d0dffb91b744313e7"},"downloads":-1,"filename":"crested-1.0.0.tar.gz","has_sig":false,"md5_digest":"e22b7268585b8aeca8dbcf17171a98b4","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":3406151,"upload_time":"2024-08-14T11:36:59","upload_time_iso_8601":"2024-08-14T11:36:59.796932Z","url":"https://files.pythonhosted.org/packages/59/59/67c962c4d2ee8be749b48abac93c308741cf2aeb56b943d352846ab6b745/crested-1.0.0.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"1.1.0":{"info":{"author":"Stein Aerts Lab","author_email":null,"bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":" Academic Non-commercial Software License Agreement  The Licensed Software is developed by and on behalf of the Laboratory of Computational Biology of VIB-KU Leuven and is owned by VIB vzw, located at Rijvisschestraat 120, B-9052 Zwijnaarde, Belgium (hereinafter referred to as \"VIB\"). By downloading or installing the Licensed Software, the user agrees with the terms and conditions below.  Definitions  “Licensed Software” shall mean CREsted as available on GitHub.  \"Effective Date\" shall mean the date on which you download or install CREsted (as available on GitHub) on your system and which provide you access to the CREsted tool.  “Commercial Purposes” shall include (1) the use of Licensed Software to provide a service, information or data that is directly or indirectly conveyed to any third party against compensation, (2) any type of transfer of the Licensed Software for compensation, and (3) any other use of Licensed Software that supports commercial entities.  License  1.\tLicensed Software is the work of the Aerts lab. The copyright in Licensed Software is owned by VIB.  2.\tSubject to the terms and conditions of this Agreement, VIB hereby grants and the user accepts a non-exclusive, non-transferable license to use the Licensed Software for strictly internal academic research use only, on your own behalf or on behalf of your institution, and not for Commercial Purposes.  3.\tThe user confirms to be an academic user. For academic users, there is no license fee.  4. The user shall acknowledge VIB as the provider of Licensed Software and shall include the following reference “Kempynck et al., CREsted: Cis Regulatory Element Sequence Training, Explanation, and Design. Zenodo (2024) 10.5281/zenodo.13320756: 2024-08” in any manuscript describing data obtained using Licensed Software.  5.\tThis license does not entitle the user to receive from VIB hard-copy documentation, technical support, telephone assistance, or enhancements or updates to the Licensed Software, and nothing contained herein shall be interpreted as to require VIB, its faculty, employees or students to provide maintenance, installation services, debugging, consultation or end-user support of any kind.  6.\tThe title and copyright to Licensed Software and any associated programs and documentation shall remain with VIB. The user agrees to preserve the same.  7.\tThe user agrees not to make any copies of Licensed Software except for use in the user’s laboratory, without VIB’s prior written consent.  The user agrees to place the appropriate copyright notice on any such copies.  8.\tThe user shall not distribute Licensed Software to other laboratories within user’s institution. The user shall not transfer Licensed Software to another location or person outside of user’s institution without VIB’s prior and written permission.  9.\tThe user shall not market or otherwise benefit commercially from any product utilizing any portion of Licensed Software, nor any derivative works of Licensed Software, without first entering into a separate commercial license with VIB.  10.\tExcept as otherwise expressly permitted in this Agreement, the user must not (i) modify or create any derivative works of the Licensed Software or documentation, including customization, translation or localization; (ii) decompile, disassemble, reverse engineer, or otherwise attempt to derive the source code for the Licensed Software; (iii) remove or alter any trademark, logo, copyright or other proprietary notices, legends, symbols or labels in the Licensed Software.  11.\tThe user acknowledges that the Licensed Software is proprietary to VIB. The software code shall be treated as trade secrets and confidential information of VIB, and the user agrees to use all reasonable efforts to hold the same in confidence. The user’s obligation for confidentiality shall not extend to any information which (i) is or becomes generally available to the public, (ii) is already known to or subsequently disclosed by third parties to the user and at its free disposal, or (iii) is independently developed by the user or its affiliates without the use of the confidential information disclosed by VIB, or (iv) is required by law or legal process to be disclosed.  12.\tThe user acknowledges that Licensed Software is a research tool and provided free of charge, it is only provided “as is”. VIB makes no representations or warranties of any type whatsoever, express or implied, regarding the Licensed Software. VIB expressly disclaims all representations and warranties regarding the Licensed Software, including but not limited to any representations or warranties of merchantability or fitness for any particular application or that the use of the Licensed Software will not infringe any patents, copyrights or trademarks or other rights of third parties, or any warranty that the rights and licenses granted hereunder comprise all the rights and licenses necessary or desirable to use the Licensed Software for internal non-commercial research purposes as permitted by this Agreement. The entire risk as to the quality and performance of the Licensed Software is borne by the user.  13.\tVIB shall not be responsible for losses of any kind resulting from the use of Licensed Software, and can in no way provide compensation for any losses sustained, including but not limited to, any obligation, liability, right, claim or remedy for tort, or for any actual or alleged infringement of patents, copyrights, trade secrets, or similar rights of third parties, nor any business expense, machine downtime or damages caused by any deficiency, defect or error in Licensed Software or mal-function thereof, nor any incidental or consequential damages, however caused.  14.\tThe user will indemnify, defend and hold harmless VIB, its directors, officers, employees and agents from and against all liability, losses, damages and expenses (including attorney’s fees and costs) arising out of any claims, demands, actions or other proceedings made or instituted by any third party against any of them and arising out of or relating to any breach of this Agreement by the user, or any use of the Licensed Software by the user, except insofar as such claims or liability result from VIB’s gross negligence or willful misconduct.  15.\tThis Agreement and the license rights granted herein shall become effective as of the date the user downloaded the Licensed Software and shall continue in full force until the user deletes the Licensed Software and any and all related files from the user’s computing system, unless terminated in accordance with this Section. Upon one party's breach of any agreement, covenant, or representation made in this Agreement, the agreement will automatically end thirty (30) days after such breach. Either party shall have the right, at any time, to terminate this Agreement without cause by written notice to the other party specifying the date of termination. Upon termination, the user shall destroy all full and partial copies of the Licensed Software. The user shall forward written notice to VIB that all programs containing Licensed Software have been deleted from all computer libraries and storage or memory devices and are no longer stored therein.  16.\tThis Agreement shall be construed in accordance with the laws of Belgium. The courts of Belgium shall have exclusive jurisdiction.  17.\tThe parties agree that this Agreement is the complete and exclusive agreement among the parties and supersedes all proposals and prior agreements whether written or oral, and all other communications among the parties relating to the subject matter of this Agreement. This Agreement cannot be modified except in writing and signed by both parties. Failure by either party at any time to enforce any of the provisions of this Agreement shall not constitute a waiver by such party of such provision nor in any way affect the validity of this Agreement.  18.\tThe invalidity of singular provisions does not affect the validity of the entire understanding. The parties are obligated, however, to replace the invalid provisions by a regulation, which comes closest to the economic intent of the invalid provision. The same shall apply mutatis mutandis in case of a gap.   THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.","maintainer":null,"maintainer_email":"Lukas Mahieu <lukas.mahieu@kuleuven.be>","name":"crested","package_url":"https://pypi.org/project/crested/","platform":null,"project_url":"https://pypi.org/project/crested/","project_urls":{"Documentation":"https://crested.readthedocs.io/","Home-page":"https://github.com/aertslab/crested/","Source":"https://github.com/aertslab/crested/"},"provides_extra":["dev","doc","test","tfmodisco"],"release_url":"https://pypi.org/project/crested/1.1.0/","requires_dist":["pandas; extra == \"doc\"","anndata","keras>=3.4.0","logomaker","loguru","numpy","pandas","pooch","pybigtools>=0.2.0","pybigwig","pysam","scikit-learn","seaborn","tqdm","wandb>=0.12.10","pre-commit; extra == \"dev\"","pydocstyle; extra == \"dev\"","pytest; extra == \"dev\"","twine>=4.0.2; extra == \"dev\"","docutils!=0.18.*,!=0.19.*,>=0.8; extra == \"doc\"","ipykernel; extra == \"doc\"","ipython; extra == \"doc\"","modisco-lite; extra == \"doc\"","myst-nb; extra == \"doc\"","ruff; extra == \"doc\"","sphinx-autodoc-typehints; extra == \"doc\"","sphinx-book-theme>=1.0.0; extra == \"doc\"","sphinx-copybutton; extra == \"doc\"","sphinx>=4; extra == \"doc\"","sphinxcontrib-bibtex>=1.0.0; extra == \"doc\"","sphinxext-opengraph; extra == \"doc\"","tensorflow; extra == \"doc\"","anndata; extra == \"test\"","coverage; extra == \"test\"","genomepy; extra == \"test\"","pytest; extra == \"test\"","modisco-lite>=2.2.1; extra == \"tfmodisco\"","tangermeme; extra == \"tfmodisco\""],"requires_python":">=3.9","summary":"CREsted: Cis-Regulatory Element Sequence Training, Explanation, and Design","version":"1.1.0","yanked":false,"yanked_reason":null},"last_serial":25431223,"urls":[{"comment_text":"","digests":{"blake2b_256":"8e3eabdb6aa4674140e4447c926a40fe6a996b5d5576b23ca511357a0b54473a","md5":"87592518ce659bc9c4a3a2f724b0d0c8","sha256":"663cabc6f068e89278c461c2a08039a8537984c3a388530da098c462fe33ddf8"},"downloads":-1,"filename":"crested-1.1.0-py3-none-any.whl","has_sig":false,"md5_digest":"87592518ce659bc9c4a3a2f724b0d0c8","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.9","size":117340,"upload_time":"2024-10-11T09:59:30","upload_time_iso_8601":"2024-10-11T09:59:30.470350Z","url":"https://files.pythonhosted.org/packages/8e/3e/abdb6aa4674140e4447c926a40fe6a996b5d5576b23ca511357a0b54473a/crested-1.1.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"4b9799ae489ea25f1174034b3eace50a7b6c4f8c75a8623ec8d918553ae8146e","md5":"f2ce3cca361e8124bc58e25980d2a4e5","sha256":"17ad82d8a6c91dd3886ecae63199fd9322dd96a4b9eb053044ee9888c6ccd6b7"},"downloads":-1,"filename":"crested-1.1.0.tar.gz","has_sig":false,"md5_digest":"f2ce3cca361e8124bc58e25980d2a4e5","packagetype":"sdist","python_version":"source","requires_python":">=3.9","size":12871488,"upload_time":"2024-10-11T09:59:32","upload_time_iso_8601":"2024-10-11T09:59:32.296083Z","url":"https://files.pythonhosted.org/packages/4b/97/99ae489ea25f1174034b3eace50a7b6c4f8c75a8623ec8d918553ae8146e/crested-1.1.0.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]}}