{"1.0.3":{"info":{"author":null,"author_email":"Jamie Kee <Jamie.Kee@nrel.gov>, Michael Penev <Michael.Penev@nrel.gov>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"END USER SOFTWARE LICENSE AGREEMENT  This License Agreement (“Agreement”) is between the Alliance for Sustainable Energy, LLC (“Alliance”),  the manager and operator of the National Renewable Energy Laboratory (“NREL”) for the U.S. Department of Energy (the “DOE”) and you (“Licensee”) hereinafter “Party” or collectively the “Parties.” By downloading, accessing, or using the Software described hereunder, you agree to be bound by the terms of this Agreement.  IF YOU ARE ENTERING INTO THIS AGREEMENT WITHIN THE SCOPE OF YOUR EMPLOYMENT OR IN CONNECTION WITH YOUR ENGAGEMENT AS AN INDEPENDENT CONTRACTOR, THEN THE TERM “LICENSEE” INCLUDES YOUR EMPLOYER OR PRINCIPAL CONTRACTOR, AS APPLICABLE, AND YOU REPRESENT AND WARRANT TO ALLIANCE THAT YOU ARE AUTHORIZED TO ACCEPT THIS AGREEMENT ON SUCH EMPLOYER’S OR PRINCIPAL CONTRACTOR’S BEHALF.  1.\tLicense Grant. Alliance hereby grants Licensee a royalty-free, nonexclusive, nontransferable, limited license for the computer software program “ProFAST (Production Financial Analysis Scenario Tool)” (NREL Software Record no. SWR-23-88) in executable format, together with any documentation provided by Alliance which relates to its functional, operational or performance characteristics, as made available to Licensee via https://www.github.com/nrel/profast, and as modified from time to time (“Software”) to install, copy, and run the Software for noncommercial, internal research purposes only. 1.1.\tLicensee may not disclose Software source code or any executable code generated therefrom to any third party. 1.2.\tLicensee may not translate, decompile, reverse engineer, disassemble or otherwise attempt to create a human-readable version of the Software to the extent supplied in object code format. 1.3.\tAny copies of the Software made by Licensee shall be subject to the terms of this Agreement. 1.4.\tAlliance reserves and retains all rights, title, and other interests in the Software and any copies thereof, which are not explicitly granted to Licensee herein. 1.5.\tAny copies of Software shall bear the following notice:  NOTICE  Copyright © 2024 Alliance for Sustainable Energy, LLC, Inc. All Rights Reserved  This computer software was produced by the Alliance for Sustainable Energy, LLC (Contractor) under Contract No. DE-AC36-08GO28308 with the U.S. Department of Energy (DOE). During the period of commercialization or such other time period specified by the DOE, the Government is granted for itself and others acting on its behalf a nonexclusive, paid-up, irrevocable worldwide license in this data to reproduce, prepare derivative works, and perform publicly and display publicly, by or on behalf of the Government. Subsequent to that period the Government is granted for itself and others acting on its behalf a nonexclusive, paid-up, irrevocable worldwide license in this data to reproduce, prepare derivative works, distribute copies to the public, perform publicly and display publicly, and to permit others to do so. The specific term of the license can be identified by inquiry made to the Contractor or DOE. NEITHER THE UNITED STATES NOR THE UNITED STATES DEPARTMENT OF ENERGY, NOR ANY OF THEIR EMPLOYEES, MAKES ANY WARRANTY, EXPRESS OR IMPLIED, OR ASSUMES ANY LEGAL LIABILITY OR RESPONSIBILITY FOR THE ACCURACY, COMPLETENESS, OR USEFULNESS OF ANY DATA, APPARATUS, PRODUCT, OR PROCESS DISCLOSED, OR REPRESENTS THAT ITS USE WOULD NOT INFRINGE PRIVATELY OWNED RIGHTS.  1.6.\tLicensee agrees to credit the DOE, NREL, and Alliance in any publication or public presentation that results from use of the Software. However, the names of NREL, DOE, or Alliance may not be used to endorse or promote products derived from this software without specific prior written permission. 1.7.\tAlliance makes no guarantee of accessibility or ongoing availability of the Repository or of the Software. Alliance may revoke Licensee’s access or remove any or all portions of the Software from the Repository at any time and for any reason (or for no reason). Licensee agrees that Alliance has no obligation to provide access to the Repository or provide the Software.  2. Maintenance or Support. Licensee assumes sole responsibility for the installation, use and results obtained from use of the Software. Alliance shall be under no obligation whatsoever to: (i) provide maintenance or support for Software; or (ii) to notify Licensee of bug fixes, patches, or upgrades to Software (if any).  If, in its sole discretion, Alliance makes a Software bug fix, patch or upgrade available to Licensee and Alliance does not separately enter into a written license agreement with Licensee relating to such bug fix, patch or upgrade, then it shall be deemed incorporated into the Software and subject to this Agreement. 3. United States Government Rights. The Software was developed under funding from the DOE, and the United States Government retains certain rights as follows: For five (5) years after the date permission to assert copyright is obtained from the DOE, and during any subsequent five (5) year renewals, the United States Government is granted for itself and others acting on its behalf a non-exclusive, paid-up, irrevocable, worldwide license in the Software to reproduce, prepare derivative works, perform publicly and display publicly.   Subsequent to that period or any extension granted, the Government is granted for itself and others acting on its behalf, a nonexclusive, paid-up, irrevocable worldwide license in the Software to reproduce, distribute copies to the public, prepare derivative works, perform publicly and display publicly, and to permit others to do so. 4. Warranty Disclaimer.  THE SOFTWARE IS SUPPLIED “AS IS” WITHOUT WARRANTY OF ANY KIND.  ALLIANCE, NREL, THE UNITED STATES GOVERNMENT, DOE, AND THEIR EMPLOYEES, OFFICERS AND AGENTS: (i) DISCLAIM ANY WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE OR NON-INFRINGEMENT, (ii) DO NOT ASSUME ANY LEGAL LIABILITY OR RESPONSIBILITY FOR THE ACCURACY, COMPLETENESS, OR USEFULNESS OF SOFTWARE, (iii) DO NOT REPRESENT THAT USE OF SOFTWARE WOULD NOT INFRINGE PRIVATELY OWNED RIGHTS, AND (iv)  DO NOT WARRANT THAT THE OPERATION OF SOFTWARE WILL BE UNINTERRUPTED, THAT IT IS ERROR-FREE OR THAT ANY ERRORS WILL BE CORRECTED. 5. Limitation of Liability. IN NO EVENT WILL ALLIANCE, NREL, DOE OR THE UNITED STATES GOVERNMENT BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, CONSEQUENTIAL, SPECIAL OR PUNITIVE DAMAGES OF ANY KIND OR NATURE (INCLUDING BUT NOT LIMITED TO LOSS OF PROFITS, LOSS OF DATA, LOSS OF USE, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES OR BUSINESS INTERRUPTION) FOR ANY REASON WHATSOEVER, WHETHER SUCH LIABILITY IS ASSERTED ON THE BASIS OF CONTRACT, TORT (INCLUDING NEGLIGENCE OR STRICT LIABILITY), OR OTHERWISE, EVEN IF ALLIANCE, NREL, DOE OR THE UNITED STATES GOVERNMENT IS MADE AWARE OF THE POSSIBILITY OF SUCH LOSS OR DAMAGES. 6. Indemnity. Licensee shall indemnify, defend, and hold harmless Alliance, the DOE, the U.S. Government, and their agents, officers, and employees, against any and all claims, suits, losses, damage, costs, fees, and expenses arising out of or in connection with Licensee’s use of the Software pursuant to this Agreement.  Licensee shall pay all costs incurred by Alliance, the DOE and the U.S. Government in enforcing this provision, including reasonable attorney fees.  Licensee shall comply with all applicable laws and regulations (including privacy laws and regulations) having application to or governing its use and/or operation of the Software and agrees to indemnify and hold DOE, Alliance and the U.S. Government harmless from and against any claims, damages, losses or obligations suffered or incurred by Alliance directly or indirectly arising from its failure to so comply. 7. Term and Termination. The license granted to Licensee under this Agreement shall continue unless terminated earlier in accordance with this Agreement. Alliance shall have the right to terminate this license in its sole discretion at any time and for any reason (or for no reason) upon notice to Licensee.  If Licensee breaches any term of this Agreement, and fails to cure such breach within thirty (30) days of the date of written notice, this Agreement shall immediately terminate.  Licensee may terminate this Agreement without cause upon thirty (30) days written notice to Alliance.  Upon termination of the Agreement, Licensee shall immediately cease using the Software, destroy all copies of the Software, and provide Alliance with written certification of Licensee’s compliance with the foregoing.  Notwithstanding any provision of this Agreement to the contrary, Sections 1.5, 1.6, and 3 through 9 shall survive termination of this Agreement. 8. Export Controls. Licensee shall observe all applicable United States and foreign laws and regulations (if any) with respect to the export, re-export, diversion or transfer of Software, related technical data and direct products thereof, including, without limitation, the Export Administration Regulations. 9. General. This Agreement, and the rights and liabilities of the Parties with respect to this Agreement and its subject matter, shall be governed by the laws of the State of Colorado, without reference to the principles of conflicts of laws thereof.  Any dispute arising out of or relating to this Agreement or its subject matter not settled by the Parties may be resolved only by the courts of the State of Colorado, or if subject matter jurisdiction exists, by the United States federal courts, with venue in the County of Denver (in the case of state court) or in the U.S. District Court for the District of Colorado (in the case of federal court).  Each of the Parties hereby consents to the jurisdiction of such courts over it in any action involving any such dispute.  Each of the Parties agree not to commence or maintain a legal proceeding involving any such dispute in any forum except a court of the State of Colorado located in Denver County or the United States District Court for the District of Colorado (other than to enforce a judgment obtained in such courts) and agrees not to contest the venue of any action involving any such dispute in the County of Denver or the District of Colorado, as the case may be, nor to assert in any such court the doctrine of forum non conveniens, or the like. Any modification or amendment of this Agreement must be in writing signed by a duly authorized representative of each Party.  This Agreement is binding upon and shall inure to the benefit of Alliance, its successors and assignees and therefore may be assigned to a successor operator of NREL for the United States Government.  This Agreement represents the entire understanding of the Parties, and supersedes all previous communications, written or oral, relating to the subject of this Agreement.  This license does not constitute an endorsement of Licensee’s products and/or services, if any, and Licensee shall not use the names, logos or brands of Alliance, NREL or DOE without the express written consent of Alliance, or DOE as applicable.  If any part of this Agreement is found void and unenforceable, it will not affect the validity of the balance of the Agreement, which shall remain valid and enforceable according to its terms. ","maintainer":null,"maintainer_email":null,"name":"ProFAST","package_url":"https://pypi.org/project/ProFAST/","platform":null,"project_url":"https://pypi.org/project/ProFAST/","project_urls":null,"provides_extra":null,"release_url":"https://pypi.org/project/ProFAST/1.0.3/","requires_dist":["importlib-resources","matplotlib","numpy","numpy-financial","pandas","plotly","pyarrow","pytest","xlwings"],"requires_python":">=3.8","summary":"Production Financial Analysis Scenario Tool","version":"1.0.3","yanked":false,"yanked_reason":null},"last_serial":25733452,"urls":[{"comment_text":"","digests":{"blake2b_256":"ae906a833e7d16293b48296ec49b76272bba1825dda9ef98a093a479e8b35f32","md5":"82faea331ce4cc7e133d533d5f8deb08","sha256":"ee370c55d0109884e1ce39143ef07b4b2b20db316d36483e4336001c87f51be3"},"downloads":-1,"filename":"ProFAST-1.0.3-py3-none-any.whl","has_sig":false,"md5_digest":"82faea331ce4cc7e133d533d5f8deb08","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":11145035,"upload_time":"2024-10-29T21:56:41","upload_time_iso_8601":"2024-10-29T21:56:41.402009Z","url":"https://files.pythonhosted.org/packages/ae/90/6a833e7d16293b48296ec49b76272bba1825dda9ef98a093a479e8b35f32/ProFAST-1.0.3-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"30c0df997533403244ac1ac0cdaf89c90aa1678c669a14fc8c87882ee0d4f9b6","md5":"eaf46f92eed1c82dc39d284c5508525d","sha256":"3b0c69ad36eb3bb0136b08d1ba62c9a50445d6200a52da360269d27fdf89c450"},"downloads":-1,"filename":"profast-1.0.3.tar.gz","has_sig":false,"md5_digest":"eaf46f92eed1c82dc39d284c5508525d","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":11137485,"upload_time":"2024-10-29T21:56:51","upload_time_iso_8601":"2024-10-29T21:56:51.647604Z","url":"https://files.pythonhosted.org/packages/30/c0/df997533403244ac1ac0cdaf89c90aa1678c669a14fc8c87882ee0d4f9b6/profast-1.0.3.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]},"1.0.4":{"info":{"author":null,"author_email":"Jamie Kee <Jamie.Kee@nrel.gov>, Michael Penev <Michael.Penev@nrel.gov>","bugtrack_url":null,"classifiers":[],"description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":null,"license":"END USER SOFTWARE LICENSE AGREEMENT  This License Agreement (“Agreement”) is between the Alliance for Sustainable Energy, LLC (“Alliance”),  the manager and operator of the National Renewable Energy Laboratory (“NREL”) for the U.S. Department of Energy (the “DOE”) and you (“Licensee”) hereinafter “Party” or collectively the “Parties.” By downloading, accessing, or using the Software described hereunder, you agree to be bound by the terms of this Agreement.  IF YOU ARE ENTERING INTO THIS AGREEMENT WITHIN THE SCOPE OF YOUR EMPLOYMENT OR IN CONNECTION WITH YOUR ENGAGEMENT AS AN INDEPENDENT CONTRACTOR, THEN THE TERM “LICENSEE” INCLUDES YOUR EMPLOYER OR PRINCIPAL CONTRACTOR, AS APPLICABLE, AND YOU REPRESENT AND WARRANT TO ALLIANCE THAT YOU ARE AUTHORIZED TO ACCEPT THIS AGREEMENT ON SUCH EMPLOYER’S OR PRINCIPAL CONTRACTOR’S BEHALF.  1.\tLicense Grant. Alliance hereby grants Licensee a royalty-free, nonexclusive, nontransferable, limited license for the computer software program “ProFAST (Production Financial Analysis Scenario Tool)” (NREL Software Record no. SWR-23-88) in executable format, together with any documentation provided by Alliance which relates to its functional, operational or performance characteristics, as made available to Licensee via https://www.github.com/nrel/profast, and as modified from time to time (“Software”) to install, copy, and run the Software for noncommercial, internal research purposes only. 1.1.\tLicensee may not disclose Software source code or any executable code generated therefrom to any third party. 1.2.\tLicensee may not translate, decompile, reverse engineer, disassemble or otherwise attempt to create a human-readable version of the Software to the extent supplied in object code format. 1.3.\tAny copies of the Software made by Licensee shall be subject to the terms of this Agreement. 1.4.\tAlliance reserves and retains all rights, title, and other interests in the Software and any copies thereof, which are not explicitly granted to Licensee herein. 1.5.\tAny copies of Software shall bear the following notice:  NOTICE  Copyright © 2024 Alliance for Sustainable Energy, LLC, Inc. All Rights Reserved  This computer software was produced by the Alliance for Sustainable Energy, LLC (Contractor) under Contract No. DE-AC36-08GO28308 with the U.S. Department of Energy (DOE). During the period of commercialization or such other time period specified by the DOE, the Government is granted for itself and others acting on its behalf a nonexclusive, paid-up, irrevocable worldwide license in this data to reproduce, prepare derivative works, and perform publicly and display publicly, by or on behalf of the Government. Subsequent to that period the Government is granted for itself and others acting on its behalf a nonexclusive, paid-up, irrevocable worldwide license in this data to reproduce, prepare derivative works, distribute copies to the public, perform publicly and display publicly, and to permit others to do so. The specific term of the license can be identified by inquiry made to the Contractor or DOE. NEITHER THE UNITED STATES NOR THE UNITED STATES DEPARTMENT OF ENERGY, NOR ANY OF THEIR EMPLOYEES, MAKES ANY WARRANTY, EXPRESS OR IMPLIED, OR ASSUMES ANY LEGAL LIABILITY OR RESPONSIBILITY FOR THE ACCURACY, COMPLETENESS, OR USEFULNESS OF ANY DATA, APPARATUS, PRODUCT, OR PROCESS DISCLOSED, OR REPRESENTS THAT ITS USE WOULD NOT INFRINGE PRIVATELY OWNED RIGHTS.  1.6.\tLicensee agrees to credit the DOE, NREL, and Alliance in any publication or public presentation that results from use of the Software. However, the names of NREL, DOE, or Alliance may not be used to endorse or promote products derived from this software without specific prior written permission. 1.7.\tAlliance makes no guarantee of accessibility or ongoing availability of the Repository or of the Software. Alliance may revoke Licensee’s access or remove any or all portions of the Software from the Repository at any time and for any reason (or for no reason). Licensee agrees that Alliance has no obligation to provide access to the Repository or provide the Software.  2. Maintenance or Support. Licensee assumes sole responsibility for the installation, use and results obtained from use of the Software. Alliance shall be under no obligation whatsoever to: (i) provide maintenance or support for Software; or (ii) to notify Licensee of bug fixes, patches, or upgrades to Software (if any).  If, in its sole discretion, Alliance makes a Software bug fix, patch or upgrade available to Licensee and Alliance does not separately enter into a written license agreement with Licensee relating to such bug fix, patch or upgrade, then it shall be deemed incorporated into the Software and subject to this Agreement. 3. United States Government Rights. The Software was developed under funding from the DOE, and the United States Government retains certain rights as follows: For five (5) years after the date permission to assert copyright is obtained from the DOE, and during any subsequent five (5) year renewals, the United States Government is granted for itself and others acting on its behalf a non-exclusive, paid-up, irrevocable, worldwide license in the Software to reproduce, prepare derivative works, perform publicly and display publicly.   Subsequent to that period or any extension granted, the Government is granted for itself and others acting on its behalf, a nonexclusive, paid-up, irrevocable worldwide license in the Software to reproduce, distribute copies to the public, prepare derivative works, perform publicly and display publicly, and to permit others to do so. 4. Warranty Disclaimer.  THE SOFTWARE IS SUPPLIED “AS IS” WITHOUT WARRANTY OF ANY KIND.  ALLIANCE, NREL, THE UNITED STATES GOVERNMENT, DOE, AND THEIR EMPLOYEES, OFFICERS AND AGENTS: (i) DISCLAIM ANY WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE OR NON-INFRINGEMENT, (ii) DO NOT ASSUME ANY LEGAL LIABILITY OR RESPONSIBILITY FOR THE ACCURACY, COMPLETENESS, OR USEFULNESS OF SOFTWARE, (iii) DO NOT REPRESENT THAT USE OF SOFTWARE WOULD NOT INFRINGE PRIVATELY OWNED RIGHTS, AND (iv)  DO NOT WARRANT THAT THE OPERATION OF SOFTWARE WILL BE UNINTERRUPTED, THAT IT IS ERROR-FREE OR THAT ANY ERRORS WILL BE CORRECTED. 5. Limitation of Liability. IN NO EVENT WILL ALLIANCE, NREL, DOE OR THE UNITED STATES GOVERNMENT BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, CONSEQUENTIAL, SPECIAL OR PUNITIVE DAMAGES OF ANY KIND OR NATURE (INCLUDING BUT NOT LIMITED TO LOSS OF PROFITS, LOSS OF DATA, LOSS OF USE, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES OR BUSINESS INTERRUPTION) FOR ANY REASON WHATSOEVER, WHETHER SUCH LIABILITY IS ASSERTED ON THE BASIS OF CONTRACT, TORT (INCLUDING NEGLIGENCE OR STRICT LIABILITY), OR OTHERWISE, EVEN IF ALLIANCE, NREL, DOE OR THE UNITED STATES GOVERNMENT IS MADE AWARE OF THE POSSIBILITY OF SUCH LOSS OR DAMAGES. 6. Indemnity. Licensee shall indemnify, defend, and hold harmless Alliance, the DOE, the U.S. Government, and their agents, officers, and employees, against any and all claims, suits, losses, damage, costs, fees, and expenses arising out of or in connection with Licensee’s use of the Software pursuant to this Agreement.  Licensee shall pay all costs incurred by Alliance, the DOE and the U.S. Government in enforcing this provision, including reasonable attorney fees.  Licensee shall comply with all applicable laws and regulations (including privacy laws and regulations) having application to or governing its use and/or operation of the Software and agrees to indemnify and hold DOE, Alliance and the U.S. Government harmless from and against any claims, damages, losses or obligations suffered or incurred by Alliance directly or indirectly arising from its failure to so comply. 7. Term and Termination. The license granted to Licensee under this Agreement shall continue unless terminated earlier in accordance with this Agreement. Alliance shall have the right to terminate this license in its sole discretion at any time and for any reason (or for no reason) upon notice to Licensee.  If Licensee breaches any term of this Agreement, and fails to cure such breach within thirty (30) days of the date of written notice, this Agreement shall immediately terminate.  Licensee may terminate this Agreement without cause upon thirty (30) days written notice to Alliance.  Upon termination of the Agreement, Licensee shall immediately cease using the Software, destroy all copies of the Software, and provide Alliance with written certification of Licensee’s compliance with the foregoing.  Notwithstanding any provision of this Agreement to the contrary, Sections 1.5, 1.6, and 3 through 9 shall survive termination of this Agreement. 8. Export Controls. Licensee shall observe all applicable United States and foreign laws and regulations (if any) with respect to the export, re-export, diversion or transfer of Software, related technical data and direct products thereof, including, without limitation, the Export Administration Regulations. 9. General. This Agreement, and the rights and liabilities of the Parties with respect to this Agreement and its subject matter, shall be governed by the laws of the State of Colorado, without reference to the principles of conflicts of laws thereof.  Any dispute arising out of or relating to this Agreement or its subject matter not settled by the Parties may be resolved only by the courts of the State of Colorado, or if subject matter jurisdiction exists, by the United States federal courts, with venue in the County of Denver (in the case of state court) or in the U.S. District Court for the District of Colorado (in the case of federal court).  Each of the Parties hereby consents to the jurisdiction of such courts over it in any action involving any such dispute.  Each of the Parties agree not to commence or maintain a legal proceeding involving any such dispute in any forum except a court of the State of Colorado located in Denver County or the United States District Court for the District of Colorado (other than to enforce a judgment obtained in such courts) and agrees not to contest the venue of any action involving any such dispute in the County of Denver or the District of Colorado, as the case may be, nor to assert in any such court the doctrine of forum non conveniens, or the like. Any modification or amendment of this Agreement must be in writing signed by a duly authorized representative of each Party.  This Agreement is binding upon and shall inure to the benefit of Alliance, its successors and assignees and therefore may be assigned to a successor operator of NREL for the United States Government.  This Agreement represents the entire understanding of the Parties, and supersedes all previous communications, written or oral, relating to the subject of this Agreement.  This license does not constitute an endorsement of Licensee’s products and/or services, if any, and Licensee shall not use the names, logos or brands of Alliance, NREL or DOE without the express written consent of Alliance, or DOE as applicable.  If any part of this Agreement is found void and unenforceable, it will not affect the validity of the balance of the Agreement, which shall remain valid and enforceable according to its terms. ","maintainer":null,"maintainer_email":null,"name":"ProFAST","package_url":"https://pypi.org/project/ProFAST/","platform":null,"project_url":"https://pypi.org/project/ProFAST/","project_urls":null,"provides_extra":null,"release_url":"https://pypi.org/project/ProFAST/1.0.4/","requires_dist":["numpy","importlib-resources","matplotlib","numpy-financial","pandas","plotly","pyarrow","pytest","xlwings"],"requires_python":">=3.8","summary":"Production Financial Analysis Scenario Tool","version":"1.0.4","yanked":false,"yanked_reason":null},"last_serial":25733452,"urls":[{"comment_text":"","digests":{"blake2b_256":"1ead02b7ccbe24600210efc11ae1519950388a01f814674e17d3728ddd6680fa","md5":"e520a31dacbb56f1c96adf8e8b42afbb","sha256":"9941dbfee89cdba7e9b68d0d4d25226b976f4a1ed8ba24435d86ecb0ac185842"},"downloads":-1,"filename":"ProFAST-1.0.4-py3-none-any.whl","has_sig":false,"md5_digest":"e520a31dacbb56f1c96adf8e8b42afbb","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.8","size":11144878,"upload_time":"2024-10-29T22:08:07","upload_time_iso_8601":"2024-10-29T22:08:07.198909Z","url":"https://files.pythonhosted.org/packages/1e/ad/02b7ccbe24600210efc11ae1519950388a01f814674e17d3728ddd6680fa/ProFAST-1.0.4-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"aeeb4164703c94b357df3ab4d1fe8cce5d34eca05e0ebd4290b17da45c55cd66","md5":"acd2f3cb352f8a561bc8e2e4f7931523","sha256":"604d743d28a7efae47438df7dccee3ef78511cb609d47f5a62554857189eadd2"},"downloads":-1,"filename":"profast-1.0.4.tar.gz","has_sig":false,"md5_digest":"acd2f3cb352f8a561bc8e2e4f7931523","packagetype":"sdist","python_version":"source","requires_python":">=3.8","size":11137282,"upload_time":"2024-10-29T22:08:09","upload_time_iso_8601":"2024-10-29T22:08:09.863153Z","url":"https://files.pythonhosted.org/packages/ae/eb/4164703c94b357df3ab4d1fe8cce5d34eca05e0ebd4290b17da45c55cd66/profast-1.0.4.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]}}